[
    {
        "title": "Resultados de perforaciones de Kootenay Silver en el Proyecto Columba Chihuahua, México: Destacados de hasta 1,455 g/ton de Plata y 2.99% de Plomo-Zinc",
        "date": "12 de febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/621-tsx-venture/ktn/175121-drill-results-from-columba-project-chihuahua-mexico-highs-to-1-455-gpt-silver-and-2-99-lead-zinc.html",
        "content": "La empresa Kootenay Silver Inc. ha publicado los resultados de once nuevos sondeos en el Proyecto de Alta Ley de Plata Columba. Este batch incluye pruebas de las vetas F e I, así como de un nuevo área objetivo, La Preciosa. Destacados de las perforaciones incluyen un hito en la veta F donde se interceptó una vena de pared colgante que contenía 411 gpt de plata, 0.184% de plomo y 0.323% de zinc en una perforación de 0.63 metros de longitud. Asimismo, se encontraron altos valores de plata en otras vetas como la Veta I. La mineralización en La Preciosa muestra un patrón de mejora en las leyes con la profundidad, lo cual indica un potencial de altas leyes en zonas más profundas a lo largo de la estructura. Kootenay Silver continuará con futuras perforaciones para seguir explorando estas zonas de alto potencial. Los resultados completos de los sondeos están disponibles en el sitio web de la compañía. El Proyecto Columba es un sistema de vetas epitermales de alta ley típico de la región y actualmente se encuentra en una etapa avanzada de exploración y desarrollo para estimar un recurso mineral inicial. Para más información detallada sobre los resultados de perforaciones anteriores en este proyecto desde 2019, se puede acceder a la lista completa en el enlace provisto. Kootenay Silver Inc. es una empresa dedicada a la exploración y desarrollo de proyectos minerales en la región de la Sierra Madre en México, focalizándose en la expansión de sus recursos de plata y el desarrollo económico de sus proyectos prioritarios en los estados de Sonora y Chihuahua. Se advierte a los inversores que las declaraciones prospectivas pueden variar debido a diferentes factores y suposiciones, y se recomienda precaución al interpretar esta información."
    },
    {
        "title": "Outcrop Silver Amplía la Huella del Sistema de Vetas de Alto Grado a más de 500 Metros con Perforación en Extensión a lo Largo de la Falla en el Sistema de Vetas La Ye",
        "date": "12 de Febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1342-tsx-venture/ocg/175120-outcrop-silver-extends-high-grade-vein-system-footprint-to-more-than-500-metres-with-step-out-drilling-along-strike-at-la-ye-vein-system.html",
        "content": "Outcrop Silver ha anunciado recientes resultados de alto grado de la veta La Lupe, parte del sistema de vetas La Ye, en su proyecto de alto grado de plata Santa Ana en Colombia. La perforación en extensión ha ampliado significativamente la huella del sistema de vetas La Ye a más de 500 metros a lo largo de la falla, con la veta La Lupe confirmada ahora por más de 200 metros a lo largo de la falla. Estos resultados refuerzan la escalabilidad del sistema y su potencial de alto grado.\n\nLos puntos destacados de la perforación son:\n- El orificio DH433 interceptó 0,82 metros con una ley de 686 gramos por tonelada de plata equivalente en la recientemente descubierta veta La Lupe.\n- Múltiples ramas estrechas de la veta La Lupe muestran un alto potencial de alto grado en profundidad de hasta 734 gramos por tonelada de plata equivalente en el orificio DH435.\n\nGuillermo Hernández, Vicepresidente de Exploración, comentó: 'El descubrimiento y extensión de la veta La Lupe dentro del sistema La Ye es un avance emocionante para el proyecto Santa Ana. Con intercepciones con leyes de 1.233 gramos por tonelada de plata equivalente en la veta La Lupe, no solo se confirma el potencial de alto grado de este sistema, sino que también destaca la escalabilidad de los sistemas de vetas de Santa Ana'.\n\nEstos resultados confirman que la veta La Lupe, una estructura recién descubierta dentro del sistema La Ye, es un contribuyente significativo al potencial de recursos en expansión del proyecto. La estrategia sistemática de perforación en extensión de Outcrop Silver en objetivos de alta prioridad como La Ye continúa brindando una expansión significativa de la huella mineralizada del proyecto Santa Ana. Estos resultados destacan el potencial de crecimiento continuo de recursos en Santa Ana y reafirman su posición como un destacado proyecto de plata de alto grado."
    },
    {
        "title": "Xali Gold anuncia excelentes recuperaciones del programa de perforación de KCA en El Oro, México",
        "date": "12 de febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1666-tsx-venture/xgc/175116-xali-gold-announces-excellent-recoveries-from-kca-drill-program-at-el-oro-mexico.html",
        "content": "La empresa Xali Gold Corp. ha anunciado resultados del programa de perforación y pruebas metalúrgicas de 2024 realizado por Kappes, Cassiday and Associates (KCA) en los Relaves Mineros Mexicanos en El Oro (el \"Proyecto de Relaves El Oro\") en México. El programa de perforación se llevó a cabo para proporcionar muestras para la evaluación metalúrgica y pruebas de los relaves y para aumentar el nivel de confianza en la estimación de recursos completada por Xali Gold en 2014. Según Joanne Freeze, Presidenta y CEO de Xali Gold, KCA ha informado a la compañía que el programa de perforación ha no solo agregado confianza en la estimación de recursos de 2014, sino que también ha mostrado la posibilidad de expansión de recursos, mejorando aún más el potencial del proyecto. Los resultados de las pruebas indican un potencial aumento del 10 al 15% en el tamaño del recurso, así como un ligero incremento en las leyes y recuperaciones de oro y plata. Las pruebas aún están en curso para optimizar la recuperación de reactivos y, por lo tanto, los costos. Se estima que los métodos recomendados podrían alcanzar recuperaciones de hasta 82% para oro y 86% para plata. Xali Gold está muy satisfecha de ver un aumento en el nivel de confianza en el trabajo anterior realizado. KCA ha aconsejado a la compañía que los estudios económicos para el Proyecto de Relaves El Oro están en curso, pero los análisis iniciales indican un excelente potencial para una operación rentable. Xali Gold ha otorgado 750,000 unidades de acciones restringidas (RSU) al Director Financiero de la compañía. Las RSU se otorgan en etapas: 20% el 31 de enero de 2025, 40% el 30 de junio de 2025, y 40% el 31 de diciembre de 2025. Una vez que se otorgan, cada RSU permite al titular adquirir una acción común de la compañía. Xali Gold tiene proyectos de oro y plata en Perú y México, con su proyecto insignia El Oro, un productor histórico de oro y plata. La empresa se ha asociado con Kappes, Cassiday & Associates (KCA) para reprocesar los relaves de la Mina México que contienen 1.27 millones de toneladas con leyes de 2.94 gpt de oro y 75.12 gpt de plata (3.85 gpt equivalente de oro). KCA tiene la posibilidad de reprocesar los relaves de la Mina México que contienen 1.27 millones de toneladas con leyes de 2.94 gpt de oro y 75.12 gpt de plata (3.85 gpt equivalente de oro), que contienen 119,900 oz de oro y 3,061,200 oz de plata. Los acuerdos prevén que Xali Gold reciba fondos de los retornos netos de fundición (NSR) de hasta 3% de cada uno de estos dos acuerdos. Además, el trabajo subterráneo realizado por RM se espera que proporcione a la empresa acceso subterráneo para perforar los objetivos de alta ley identificados. Se espera que futuras exploraciones se centren en la propiedad El Oro en México, que cubre 20 vetas con producción pasada y más de 57 vetas en total, de las cuales se reporta la producción de aproximadamente 6.4M ozs de oro y 74M ozs de plata solo de dos de esas vetas. Xali Gold actualmente está revisando objetivos de oro asociados a altas sulfataciones en Perú. Xali Gold mantiene su compromiso de ser un socio comunitario responsable. Para más información, contactar a: Joanne Freeze, Presidenta & CEO Tel: +1 604-512-3359."
    },
    {
        "title": "Apollo Silver Detalla el Programa de Trabajo de Calico 2025 y el Progreso en Cinco de Mayo",
        "date": "12 de febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/2822-tsx-venture/apgo/175103-apollo-silver-outlines-2025-calico-work-program-and-progress-at-cinco-de-mayo.html",
        "content": "Apollo Silver Corp. ha presentado detalles sobre el próximo programa de trabajo de 2025 (el 'Programa 2025') en su Proyecto de Plata Calico, ubicado en el Condado de San Bernardino, California, así como una actualización sobre el recientemente opcionado Proyecto Cinco de Mayo en Chihuahua, México. Entre los aspectos más destacados se encuentran el inicio del programa de trabajo de barita para definir y agregar este mineral crítico a una estimación de recursos minerales actualizada para Waterloo, así como el inicio de un programa de mapeo y muestreo en el área de la mina Burcham de Waterloo, siguiendo los resultados de muestreo de oro en superficie, previo a un programa de perforación para expandir la mineralización de oro identificada en la estimación de recursos minerales de Waterloo de 2023 (MRE). Además, se destaca la elección de un nuevo ejecutivo para Ejido Benito Juárez, propietario de los derechos superficiales que cubren las concesiones de Cinco de Mayo, lo que abre la posibilidad de discutir el desarrollo de recursos de forma más significativa después de varios años. El Programa 2025 de Calico consistirá en dos componentes principales: expandir la MRE de Waterloo de 2023 definiendo y potencialmente agregando barita al recurso, y mapear y muestrear donde las formaciones de Barstow y Pickhandle se exponen en superficie en el área de la mina Burcham. El Programa de Barita incluirá un reanálisis completo de muestras de perforación seleccionadas, mientras que el Programa de Burcham comprenderá un mapeo y programa de perforación para comprender mejor la extensión de la mineralización de oro en superficie. Se espera que estas iniciativas generen información valiosa para los accionistas de Apollo Silver. Barita es un mineral crítico clave identificado en el informe del USGS de 2022, esencial para la seguridad nacional y la economía, con una alta demanda en la industria energética como agente de ponderación en la perforación de petróleo. Los esfuerzos actuales buscan actualizar la estimación de recursos de Waterloo de 2023 con barita para aumentar el valor del proyecto. Por otro lado, la mineralización de oro en Calico, específicamente en el área de Burcham, ha mostrado un alto potencial, con resultados de muestreo en superficie y programas de perforación anteriores que han delineado zonas de mineralización de oro. El equipo técnico de la compañía sigue investigando y planea enfocarse en el contacto entre las formaciones de Barstow y Pickhandle para caracterizar mejor la extensión de esta mineralización de oro. En resumen, Apollo Silver está avanzando en la exploración y desarrollo de sus proyectos de plata, destacando el potencial de Calico y Cinco de Mayo para contribuir al sector minero y a la economía local en los próximos años."
    }
]