[
    {
        "title": "Silver Storm Mining Announces 107% Increase in Indicated Mineral Resources at La Parrilla",
        "date": "2025-02-11",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/433-tsx-venture/svrs/175028-silver-storm-announces-107-increase-in-indicated-mineral-resources-at-la-parrilla.html",
        "content": "TORONTO / Feb 11, 2025 / Business Wire /Silver Storm Mining Ltd.(“Silver Storm” or the \"Company\") (TSX.V: SVRS | OTC: SVRSF | FSE: SVR), is pleased to announce the results of an updated Mineral Resource estimate (“Updated Mineral Resource Estimate”) reported in compliance with National Instrument 43-101 Standards of Disclosure for Mineral Projects (“NI 43-101”)for the Company’s 100% owned La Parrilla Silver Mine Complex, located in Durango Mexico. The Updated Mineral Resource Estimate was completed by David F. Machuca-Mory, PhD, PEng, of SRK Consulting (Canada) Inc. (“SRK”).Highlights of the Updated Mineral Resource Estimate include:107% increase in Indicated Mineral Resources, from 5.2 Moz Ag.Eq1,2in the 2023 Mineral Resource Statement to 10.8 Moz Ag.Eq58% increase of Inferred Mineral Resources, from 10.3 Moz Ag.Eq in the 2023 Mineral Resource Statement to 16.3 Moz Ag.EqApproximately 90% of the Indicated and 85% of the Inferred Mineral Resource tonnage is sulphide mineralization; 10% of the Indicated and 15% of the Inferred Mineral Resource tonnage is oxide mineralizationSilver dominant: 66% of the Indicated and 69% of the Inferred Updated Mineral Resource gross metal value is derived from silver23 additional mineralized structures have been modelled, including several that were previously mined by the former operator, with significant upside potentialTotal all-in exploration cost of US$0.22/oz Ag.Eq discoveredGreg McKenzie, President and CEO, commented,“We are incredibly pleased with this latest resource update. We achieved a material 107% increase in Indicated Resources and there was also a significant increase in Inferred Resources at La Parrilla. With further drilling, we would expect to maintain a continued conversion rate. The Company is now very well positioned, having a fully permitted silver mine complex, with a sizable Mineral Resource endowment that could potentially feed the La Parrilla processing plant for several years.Our sizable Mineral Resource growth in both classification categories is a testament to the hard work and dedication of the team including Will Ansley, COO and Bruce Robbins, P.Geo, our exploration personnel, operating employees and drilling contractor. Silver Storm completed 18,626 metres (“m”) of underground drilling, demonstrating that the previously mined zones continue down plunge and in certain cases even show improved grade and thickness at depth. This significant growth in Mineral Resources enhances the potential of our project, supports our goal to restart the mine and join the exclusive rank of silver producers.”The wireframe models of the veins contributing to the updated Mineral Resource Estimate of Rosarios and Quebradillas mines are presented in Figure 1 and Figure 2, respectively.Mineral Resources SummaryIndicated Mineral Resourcesare estimated at 1,197,000 tonnes (“t”) grading 280 g/t Ag.Eq*(187 g/t Ag, 0.10 g/t Au, 1.56% Pb, 1.69% Zn) which equates to 7.2 million ounces (“Moz”) Ag, 3,900 ounces (“oz”) Au, 18,600 t Pb, and 20,300 t Zn or 10.8 Moz Ag.Eq.Inferred Mineral Resourcesare estimated at 1,988,000 t grading 255 g/t Ag.Eq (175 g/t Ag, 0.12 g/t Au, 1.27% Pb, 1.42% Zn) which equates to 11.2 Moz Ag, 7,700 oz Au, 25,300 t Pb, and 28,200 t Zn or 16.3 Moz Ag.Eq.The Updated Mineral Resource Estimate includes an additional 138 core boreholes, totaling 18,626 m, as well as an exhaustive reinterpretation of the mineralized structures, completed after the acquisition of La Parrilla in August 2023. The increased information and understanding of the geological framework resulted in an increase of 74% of the interpreted mineralization volume, which includes 23 additional mineralized structures to the 22 reported mineralized structures in 2023 (Figures 1 & 2).The Mineral Resource estimation process at La Parrilla is aligned with generally accepted CIM Estimation of Mineral Resources and Mineral Reserves Best Practices Guidelines (November 2019). The Independent qualified person (QP) has applied particular care in the incorporation of the reasonable prospects for eventual economic extraction (“RPEEE”) to Mineral Resources. The QP used a stope optimizer to identify those portions of the block model that can be reasonably expected to be extracted using selective underground mining methods.Table 1 represents the Mineral Resource Statement for the La Parrilla Mine, effective December 31, 2024.Figure 3 summarizes the contained metal (Ag.Eq) changes in the Mineral Resources Statement from 2023 to 2024. Additional drilling in 2023 and 2024 confirmed the continuity of vein mineralization, increasing the Indicated Resources Ag.Eq metal content by 107% and increasing Inferred Resources by 22%. respectively. The 23 newly interpreted mineralized structures, enhanced by new drilling and a thorough review of the legacy First Majestic Silver Mineral Resources database, contributed an additional 22% and 44% to the Ag.Eq metal content in Indicated and Inferred Resources, respectively.Since 2023, the Company has collected significant specific gravity (SG) data, improving confidence in the in-situ density of mineralization in oxidized and sulphide materials, distinct from host rock density. This update has increased the estimated Ag-Eq metal content by over 10%, though these gains are largely offset by updated cut-off grades. Refreshed RPEEE criteria, with revised costs, metal prices and optimization parameters, led to slight reduction of 15% and 10% in the Ag-Eq metal content of Indicated and Inferred Resources, respectively.Table 1: Mineral Resource Statement*, La Parrilla Mine, Durango, Mexico. SRK Consulting (Canada) Inc., December 31, 2024.Category &MineralTypeMineQuantity(kt)GradeContained MetalSilverGoldLeadZincAg-EqSilverGoldLeadZincAg.Eq(g/t)(g/t)(%)(%)(g/t)(koz)(koz)(kt)(kt)(koz)Indicated Mineral ResourceOxidesRosarios176360.070.000.006433410.00.00.0345San Marcos1002530.160.000.002698180.50.00.0867Quebradillas0.41880.100.000.0019720.00.00.03Subtotal Indicated Oxides1173080.150.000.003221,1620.60.00.01,215SulphidesRosarios4761570.131.531.382432,4032.17.36.63,723San Marcos733020.171.130.833677080.40.80.6861Quebradillas5311720.051.992.472912,9260.910.513.14,966Subtotal Indicated Sulphides1,0791740.101.731.882756,0373.418.620.39,550Total Indicated Resources1,1971870.101.561.692807,1993.918.620.310,765Inferred Mineral ResourceOxidesRosarios222970.080.000.003042070.10.00.0212San Marcos2202810.140.000.002941,9881.00.00.02,080Quebradillas172210.090.000.002291230.00.00.0128Subtotal Inferred Oxides2592780.130.000.002902,3181.10.00.02,419SulphidesRosarios8641440.131.461.332284,0093.712.611.56,319San Marcos1512200.221.090.692841,0711.11.71.01,383Quebradillas7141640.081.542.202683,7721.911.015.76,149Subtotal Inferred Sulphides1,7291590.121.461.632498,8526.725.328.213,850Total Inferred Resources1,9881750.121.271.4225511,1697.725.328.216,269*(1)Block model estimates audited by David F. Machuca-Mory, PhD, PEng, Principal Consultant (Geostatistics), SRK Consulting Canada Inc.(2)Mineral Resources are not Mineral Reserves and do not have demonstrated economic viability.(3)Mineral Resources have been classified in accordance with the Canadian Institute of Mining, Metallurgy and Petroleum (\"CIM\") Definition Standards on Mineral Resources and Mineral Reserves.(4)All figures rounded to reflect the relative accuracy of the estimates.(5)Reasonable prospects of eventual economic extraction were considered by applying appropriate cut-off grades, removing unrecoverable portions of the estimates, and reporting within potentially mineable shapes.(6)Metal prices considered were US$24.00 /oz Ag, US$2,000 /oz Au, US$1.00 /lb Pb and US$1.35 /lb zinc.(7)Cut-off grade considered for oxide and sulphide block model estimates were, respectively 165 g/t Ag-Eq and 145 g/t Ag-Eq. They are based on 2017 costs adjusted by the inflation rate and include sustaining costs.(8)Metallurgical recovery used for oxides based on weighted 2015-2017 actuals was 70.1% for silver and 82.8% for gold(9)Metallurgical recovery used for sulphides based on weighted 2015-2017 actuals was 79.6% for silver, 80.1% for gold, 74.7% for lead and 58.8% for zinc.(10)Metal payable applied was 99.6% for silver and 95% for gold in doré produced from oxides.(11)Metal payable applied was 95% for silver, gold, and lead and 85% for zinc in concentrates produced from sulphides(12)Silver equivalent grade is estimated as: Ag.Eq = Ag Grade + [ (Au Grade x Au Recovery x Au Payable x Au Price / 31.1035) + (Pb Grade x Pb Recovery x Pb Payable x Pb Price x 2204.62) + (Zn Grade x Zn Recovery x Zn Payable x Zn Price x 2204.62)] / (Ag Recovery x Ag Payable x Ag Price / 31.1035)(13)Tonnage is expressed in thousands of tonnes; metal content is expressed in thousands of ounces or thousands of tonnes(14)Totals may not add up due to roundingSensitivity AnalysisIn addition to the base case scenario presented in Table 1, Tables 2 through Table 5 below, provide sensitivity analyses which demonstrate the variation in grade, tonnage and contained metal for the Updated Mineral Resource estimate at various cut-off grades for both sulphide and oxide material at La Parrilla. The sensitivity analysis shows the resiliency of the Mineral Resource to changes in the cut-off grade, which reflect the operating cost and metal pricing environment.Table 2: La Parrilla Silver Mine – Block Model Quantities and Grade Estimates(*)at Various Cut-Off Grades for Indicated Oxide Material (SRK, 2024)Cut-offGradeAg.Eq (g/t)Quantity(kt)GradeMetal ContentSilver(g/t)Gold(g/t)Ag.Eq(g/t)Silver(koz)Gold(koz)Ag.Eq(koz)1351632630.152771,3790.81,4541401552700.152841,3430.71,4141451482760.152901,3110.71,3791501402830.152971,2740.71,3391601243000.153141,1960.61,2521651173080.153221,1620.61,2151701103170.153311,1250.51,174180983360.143491,0540.51,096190863560.143709840.41,020200783730.143869340.4967210693940.144078730.3901(*) Figures in this table should not be misconstrued for a Mineral Resource Statement. The figures are only presented to show the sensitivity of the block model estimates to the selection of a cut-off grade.Table 3: La Parrilla Silver Mine – Block Model Quantities and Grade Estimates(*)at Various Cut-Off Grades for Indicated Sulphide Material (SRK, 2024)Cut-offGradeAg.Eq(g/t)Quantity(kt)GradeMetal ContentSilver(g/t)Gold(g/t)Lead(%)Zinc(%)Ag.Eq(g/t)Silver(koz)Gold(koz)Lead(kt)Zinc(kt)Ag.Eq(kozt)1201,2551610.101.601.742556,4943.920.121.910,3031251,2191640.101.621.772596,4113.819.821.510,1591301,1851660.101.651.792636,3273.719.521.210,0221351,1511690.101.671.822676,2353.619.320.99,8731401,1151710.101.701.852716,1423.518.920.69,7151451,0791740.101.731.882756,0373.418.620.39,5501501,0441770.101.751.912795,9333.218.319.99,3831609791820.101.811.962885,7343.117.719.29,0571659461850.101.841.992925,6223.017.418.98,8801709061890.101.872.032985,4892.816.918.48,6641808421950.101.932.093075,2682.616.317.68,301(*) Figures in this table should not be misconstrued for a Mineral Resource Statement. The figures are only presented to show the sensitivity of the block model estimates to the selection of a cut-off grade.Table 4: La Parrilla Silver Mine – Block Model Quantities and Grade Estimates(*)at Various Cut-Off Grades for Inferred Oxide Material (SRK, 2024)Cut-offGradeAg.Eq (g/t)Quantity(kt)GradeMetal ContentSilver(g/t)Gold(g/t)Ag.Eq(g/t)Silver(koz)Gold(koz)Ag.Eq(koz)1353762350.122462,8431.52,9831403552410.122532,7561.42,8891453342480.122602,6671.32,7931503152550.132672,5841.32,7041602772700.132822,4061.12,5141652592780.132902,3181.12,4191702382890.133012,2101.02,3051802093060.133192,0590.92,1411901873220.133341,9380.82,0102001663400.133521,8160.71,8812101473590.133711,6990.61,754(*) Figures in this table should not be misconstrued for a Mineral Resource Statement. The figures are only presented to show the sensitivity of the block model estimates to the selection of a cut-off grade.Table 5: La Parrilla Silver Mine – Block Model Quantities and Grade Estimates(*)at Various Cut-Off Grades for Inferred Sulphide Material (SRK, 2024)Cut-offGradeAg.Eq(g/t)Quantity(kt)GradeMetal ContentSilver(g/t)Gold(g/t)Lead(%)Zinc(%)Ag.Eq(g/t)Silver(koz)Gold(koz)Lead(kt)Zinc(kt)Ag.Eq(kozt)1202,1121450.121.341.492289,8678.028.231.415,4931252,0301480.121.361.522329,6697.727.630.815,1711301,9551510.121.381.542369,4797.527.130.214,8591351,8841530.121.411.572409,2837.226.529.614,5511401,7991570.121.441.602459,0576.925.828.814,1751451,7291590.121.461.632498,8526.725.328.213,8501501,6491630.121.491.662548,6206.424.627.313,4651601,5011690.121.541.712648,1695.923.225.712,7241651,4311730.121.571.742697,9445.622.524.912,3511701,3681760.121.601.772737,7335.421.924.212,0121801,2271840.121.661.832847,2534.820.322.511,211(*) Figures in this table should not be misconstrued for a Mineral Resource Statement. The figures are only presented to show the sensitivity of the block model estimates to the selection of a cut-off grade.A technical report is being prepared to support the Updated Mineral Resource Estimate in accordance with NI 43-101and will be available on the Company's website and SEDAR within 45 days of the date of this releaseQuality Assurance / Quality ControlSilver Storm uses a quality assurance/quality control (QA/QC) program that monitors the chain of custody of samples and includes the insertion of blanks, duplicates, and reference standards in each batch of samples sent for analysis. The drill core is photographed, logged, and cut in half, with one half retained in a secured location for verification purposes and one half shipped for analysis. Sample preparation (crushing and pulverizing) is performed at ALS Geochemistry, an independent ISO 9001:2001 certified laboratory, in Zacatecas, Mexico and pulps are sent to ALS Geochemistry in Vancouver, Canada for analysis. The entire sample is crushed to 70% passing -2 mm, and a riffle split of 250 grams is taken and pulverized to better than 85% passing 75 microns. Samples are analyzed for gold using a standard fire assay with Atomic Absorption Spectrometry (AAS) (Au-AA23) from a 30-gram pulp. Gold assays greater than 10 g/t are re-analyzed on a 30-gram pulp by fire assay with a gravimetric finish (Au-GRA21). Samples are also analyzed using a 34 element inductively coupled plasma (ICP) method with atomic emission spectroscopy (AES) on a pulp digested by four acids (ME-ICP61). Overlimit sample values for silver (>100 g/t), lead (>1%), zinc (>1%), and copper (>1%) are re-assayed using a four-acid digestion overlimit method with ICP-AES (ME-OG62). For silver values greater than 1,500 g/t, samples are re-assayed using a fire assay with gravimetric finish on a 30-gram pulp (Ag-GRA21). Samples with lead values over 20% are re-assayed using volumetric titration with EDTA on a 1-gram pulp (Pb-VOL70). No QA/QC issues were noted with the 2023-24 drill results.From 2007 to 2012, First Majestic Silver (“FMS”) implemented a quality control program to evaluate silver assay results from La Parrilla Laboratory for chip and core samples by submitting one core sample for every 20 original samples to Inspectorate in Reno, Nevada for duplicate check assaying. Check assays of channel samples were performed by SGS Durango. From 2013 to 2014, quality control samples included duplicates, in-house standard reference materials (SRMs) and blanks, with an overall quality control insertion rate of about 5%. The quality control procedure was updated in 2015 to include quarter core field duplicates, coarse and pulp duplicates, certified reference materials (CRMs) and blanks, with an overall quality control insertion rate of about 16%.In the opinion of the Independent QP, the quality of the analytical data collected for silver, gold, lead and zinc from San Marcos, Rosarios, and Quebradillas resource areas is sufficiently reliable to support Mineral Resource estimation. Sample preparation, analysis, and security by Silver Storm and FMS are generally performed in accordance with industry best practice standards.In the opinion of the Independent QP, a reasonable level of verification has been completed and no material issues would have been left unidentified from the verification programs undertaken. Drill data are typically verified prior to Mineral Resource estimation through software program checks, comparison to original hard copy data, and peer review. The quality of the drill data is sufficiently reliable to support Mineral Resource estimation.Qualified PersonThe Independent Qualified Person for the Mineral Resource Estimate disclosure is Dr. David Machuca-Mory, PEng, of SRK Consulting (Canada) Inc., who has reviewed and approved the contents of this release. In accordance with NI 43-101 Standards of Disclosure for Mineral Projects, Bruce Robbins, PGeo, is the Qualified Person for the Company and has validated and approved the technical and scientific content of this news release.Information Concerning Estimates of Mineral ResourcesThe scientific and technical information in this news release was prepared in accordance with NI 43-101 which differs significantly from the requirements of the U.S. Securities and Exchange Commission (the “SEC”). The terms \"Measured Mineral Resource\", \"Indicated Mineral Resource\" and \"Inferred Mineral Resource\" used in this news release are in reference to the mining terms defined in the Canadian Institute of Mining, Metallurgy and Petroleum Standards (the “CIM Definition Standards”), which definitions have been adopted by NI 43-101. Accordingly, information contained in this news release providing descriptions of our mineral deposits in accordance with NI 43-101 may not be comparable to similar information made public by other U.S. companies subject to the United States federal securities laws and the rules and regulations thereunder.You are cautioned not to assume that any part or all of Mineral Resources will ever be converted into Reserves. Pursuant to CIM Definition Standards, “Inferred Mineral Resources” are that part of a Mineral Resource for which quantity and grade or quality are estimated on the basis of limited geological evidence and sampling. Such geological evidence is sufficient to imply but not verify geological and grade or quality continuity. An Inferred Mineral Resource has a lower level of confidence than that applying to an Indicated Mineral Resource and can not be converted to a Mineral Reserve. However, it is reasonably expected that the majority of Inferred Mineral Resources could be upgraded to Indicated Mineral Resources with continued exploration. Under Canadian reporting guidelines, estimates of Inferred Mineral Resources may not form the basis of feasibility or pre-feasibility studies, except in rare cases. Investors are cautioned not to assume that all or any part of an Inferred Mineral Resource is economically or legally mineable. Disclosure of “contained ounces” in a Mineral Resource is permitted disclosure under Canadian regulations; however, the SEC normally only permits issuers to report mineralization that does not constitute “Reserves” by SEC standards as in place tonnage and grade without reference to unit measures.Canadian standards, including the CIM Definition Standards and NI 43-101, differ significantly from standards in the SEC Industry Guide 7. Effective February 25, 2019, the SEC adopted new mining disclosure rules under subpart 1300 of Regulation S-K of the United States Securities Act of 1933, as amended (the “SEC Modernization Rules”), with compliance required for the first fiscal year beginning on or after January 1, 2021. The SEC Modernization Rules replace the historical property disclosure requirements included in SEC Industry Guide 7. As a result of the adoption of the SEC Modernization Rules, the SEC now recognizes estimates of “Measured Mineral Resources”, “Indicated Mineral Resources” and “Inferred Mineral Resources”. Information regarding Mineral Resources contained or referenced in this news release may not be comparable to similar information made public by companies that report according to U.S. standards. While the SEC Modernization Rules are purported to be “substantially similar” to the CIM Definition Standards, readers are cautioned that there are differences between the SEC Modernization Rules and the CIM Definitions Standards. Accordingly, there is no assurance any Mineral Resources that the Company may report as “Measured Mineral Resources”, “Indicated Mineral Resources” and “Inferred Mineral Resources” under NI 43-101 would be the same had the Company prepared the Resource Estimates under the standards adopted under the SEC Modernization Rules.About Silver Storm Mining Ltd.Silver Storm Mining Ltd. holds advanced-stage silver projects located in Durango, Mexico. In August 2023 Silver Storm completed the acquisition of 100% of the La Parrilla Silver Mine Complex, a prolific operation which is comprised of a 2,000 tpd mill as well as five underground mines and an open pit that collectively produced 34.3 million silver-equivalent ounces between 2005 and 2019. The Company also holds a 100% interest in the San Diego Project, which is among the largest undeveloped silver assets in Mexico. For more information regarding the Company and its projects, please visit our website atwww.silverstorm.ca.Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this news release.Cautionary Note Regarding Forward Looking Statements:Certain statements in this news release are forward-looking and involve a number of risks and uncertainties. Such forward-looking statements are within the meaning of the phrase ‘forward-looking information’ in the Canadian Securities Administrators’ National Instrument 51-102 – Continuous Disclosure Obligations. Forward-looking statements are not comprised of historical facts. Forward-looking statements include estimates and statements that describe the Company’s future plans, objectives or goals, including words to the effect that the Company or management and Qualified Persons (in the case of technical and scientific information) expects a stated condition or result to occur. Forward-looking statements may be identified by such terms as “believes”, “anticipates”, “expects”, “estimates”, “may”, “could”, “would”, “will”, or “plan”. Since forward-looking statements are based on assumptions and address future events and conditions, by their very nature they involve inherent risks and uncertainties. Although these statements are based on information currently available to the Company, the Company provides no assurance that actual results will meet management’s expectations. Risks, uncertainties and other factors involved with forward-looking information could cause actual events, results, performance, prospects and opportunities to differ materially from those expressed or implied by such forward-looking information. Forward-looking information in this news release includes, but is not limited to the estimated Mineral Resources of La Parrilla and the future exploration performance, the ability to eventually place the La Parrilla Complex back into production, and, the timing and completion of an updated technical report for La Parrilla Complex.In making the forward-looking statements included in this news release, the Company and Qualified Persons (in the case of technical and scientific information) have applied several material assumptions, including that the Company´s financial condition and development plans do not change because of unforeseen events, that future metal prices and the demand and market outlook for metals will remain stable or improve, management’s ability to execute its business strategy and no unexpected or adverse regulatory changes with respect to La Parrilla. Forward-looking statements and information are subject to various known and unknown risks and uncertainties, many of which are beyond the ability of the Company to control or predict, that may cause the Company’s actual results, performance or achievements to be materially different from those expressed or implied thereby, and are developed based on assumptions about such risks, uncertainties and other factors set out herein, including, but not limited to, there being no assurance that the Company’s current and future exploration programs will grow the Mineral Resource base or upgrade Mineral Resource confidence, the risk that the assumptions referred to above prove not to be valid or reliable, the risk that the Company is unable to achieve its goal of placing La Parrilla back into production; market conditions and volatility and global economic conditions including increased volatility and potentially negative capital raising conditions resulting from the continued or escalation of the COVID-19 pandemic, risk of delay and/or cessation in planned work or changes in the Company’s financial condition and development plans; risks associated with the interpretation of data (including in respect of third party mineralized material) regarding the geology, grade and continuity of mineral deposits, the uncertainty of the geology, grade and continuity of mineral deposits and the risk of unexpected variations in Mineral Resources, grade and/or recovery rates; risks related to gold, silver and other commodity price fluctuations; employee relations; relationships with and claims by local communities and indigenous populations; availability and increasing costs associated with mining inputs and labour, the speculative nature of mineral exploration and development, including the risks of obtaining necessary licenses and permits and the presence of laws and regulations that may impose restrictions on mining, including the Mexican mining reforms; risks relating to environmental regulation and liability; the possibility that results will not be consistent with the Company’s expectations.Such forward-looking information represents managements and Qualified Persons (in the case of technical and scientific information) best judgment based on information currently available. No forward-looking statement can be guaranteed, and actual future results may vary materially. Accordingly, readers are advised not to place undue reliance on forward-looking statements or information."
    },
    {
        "title": "Silver Tiger Metals Intersects 3.0 meters of 1,526.3 g/t Silver Equivalent Within 17.3 meters of 309.0 g/t Silver Equivalent in the Sulfide Zone from Underground Drilling Station",
        "date": "2025-02-11",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1429-tsx-venture/slvr/175032-silver-tiger-intersects-3-0-meters-of-1-526-3-g-t-silver-equivalent-within-17-3-meters-of-309-0-g-t-silver-equivalent-in-the-sulfide-zone-from-underground-drilling-station.html",
        "content": "HALIFAX, NS / ACCESS Newswire / February 11, 2025 /Silver Tiger Metals Inc.(TSXV:SLVR) and (OTCQX:SLVTF) (\"Silver Tiger\" or the \"Corporation\") has received the first assay results from the drilling campaign being conducted from underground drill pads targeting the high-grade Vein, Sulfide and Shale Zones on its 100% owned, silver-gold El Tigre Project (the \"Project\" or \"El Tigre\") located in Sonora, Mexico.Highlights from the drilling program include the following:Hole ET-24-627:3.0 meters grading 1,526.3 g/t total silver equivalentfrom 297.5 meters to 300.5 meters, consisting of 833.5 g/t silver, 0.13 g/t gold, 0.87% copper, 6.22% lead and 13.24% zinc within17.3 meters grading 309.0 g/t total silver equivalentfrom 297.5 meters to 314.8 meters consisting of 160.0 g/t silver, 0.12 g/t gold, 0.18% copper, 1.34% lead and 2.68% zinc in the Sulfide Zone (Figure 1 and 2).Hole ET-23-626:4.8 meters grading 321.0 g/t total silver equivalentfrom 253.5 meters to 258.3 meters, consisting of 254.1 g/t silver, 0.10 g/t gold, 0.33% copper, 0.33% lead and 0.61% zinc within17.1 meters grading 140.0 g/t total silver equivalentfrom 242.0 meters to 259.1 meters consisting of 95.4 g/t silver, 0.09 g/t gold, 0.13% copper, 0.29% lead and 0.54% zinc in the Sulfide Zone (Figure 1).Table 1: Drill Hole ResultsHole IDCommentFrommTomLength(1)mGold g/tSilverg/tCopper%Lead%Zinc%AgEq Total(2)g/tET-24-626Sulfide Zone242.00259.0517.050.0995.40.130.290.54140.0including253.50258.304.800.10254.10.330.330.61321.0and276.50289.3612.860.6427.60.060.150.2493.3including282.70289.366.660.4850.40.100.260.42116.1and323.00327.104.100.2614.40.080.851.53112.7ET-24-627Sulfide Zone245.50251.806.300.1768.20.10.50.7128.5and297.50314.8017.300.12160.00.181.342.68309.0including297.50300.503.000.13833.50.876.2213.241,526.3ET-25-628Sulfide Zone287.90297.609.700.31111.20.260.671.00208.4Including287.90290.452.550.67283.50.480.751.44445.4Notes: 1. Not true width.2. Silver Equivalent (\"EqAg\") ratios are based on a silver to gold price ratio of 75:1 (Au:Ag). Copper, lead and zinc are converted using $3.66/lb copper, $0.90/lb lead, $1.26/lb zinc at 100% metal recoveries based on a silver price of $26.00/oz.Glenn Jessome, President & CEO stated \"After completing our PFS for the open pit portion of the El Tigre Project we commenced an underground drilling program from the end of our 400-meter-long rehabilitated haulage-way, and have received promising, multi-kilo results from the Sulfide Zone. Drilling will target the high-grade Veins, Sulfide and Shale Zones as close as 40 meters below the pre-existing haulage way, providing valuable assay and geotechnical insight for the Mineral Resource blocks near the completed haulage-way close to first development as we work to complete a PEA on the underground portion of the El Tigre project in the first half of 2025.\"Mr. Jessome further stated, \"With the PFS for the open pit completed and ready-to-build, and the PEA for the underground nearing completion, we continue to develop El Tigre into a large, long life mining complex.\"High-Grade Mineralized Zones at El TigreThe El Tigre Project underground drilling campaign is targeting the Veins, the Sulfide Zone and the Shale Zone with the first three holes targeting the Sulfide Zone. These high-grade zones form a crucial early component of the UG PEA as enumerated below (see Figure 3 for Zone numbering):Sulfide Zone- Hosted at the contact between a basement granite and younger volcanics, the currently defined Sulfide Zone is 750 meter along strike with 250 meters along dip and typically 2-20 meters thick. Mineralization consists of varying semi-massive proportions of zinc, iron, lead, copper, and silver sulfides with, for example, Drill Hole 434 grading 10.5 meters at 1,642.4 g/t total silver equivalent consisting of 914.0 g/t silver, 0.20 g/t gold, 1.68% copper, 5.92% lead and 12.42% zinc (see press release dated January 25, 2023).Shale Zone- Occurring at the intersection of Veins and a property-wide carbonate/shale layer, this silver and base metal-rich mineralization extends 20 meters in either direction from the vein, with thicknesses reaching upwards of 15 meters, and several kilometers along strike. Grades and widths are significant with, for example, Drill Hole 329 grading 9.1 meters at 809.7 g/t silver equivalent consisting of 429.5 g/t silver, 0.22 g/t gold, 0.22% copper, 4.82% lead and 6.89% zinc (see press release dated May 17, 2022).Veins- The high-grade epithermal veins dip steeply to the west, and are typically 0.5 m wide, and locally can be up to 5 m in width. Several exist on the property, with many reaching strike length of 3 kilometers or more. Vein mineralization consists of quartz and varying proportions of zinc, iron, lead, copper, and silver sulfides. These historically mined Veins have, for example Drill Hole ET-21-264, returned assays up to 82,827.3 g/t silver equivalent over 0.5 meters proximal to historically mining stopes, showing high-grade Vein mineralization continues at depth and along strike (see press release dated Nov 9, 2021).Attached as illustrations are the Plan View - Underground Drilling, Sulfide Zone-Cross Section 4925N, El Tigre - Conceptual Cross Section, El Tigre-Conceptual Long Section, and El Tigre Long Section Showing Exploration Potential.Figure 1 : Plan View - Underground DrillingFigure 2 : Sulfide Zone-Cross Section 4925NFigure 3: El Tigre - Conceptual Cross Section Showing Mineralization StylesFigure 4: El Tigre-Conceptual Long Section Showing Mineralization StylesFigure 5: El Tigre-Long Section Showing Exploration PotentialTable 2: Drill Hole LocationsHole IDEastingNorthingElevation (m)AzimuthDipLength (m)ET-24-626670,749.13,384,961.51705.5104-54330.5ET-24-627670,749.23,384,962.01705.498-53350.2ET-24-628670,748.43,384,961.41705.3118-55350.52025 Upcoming Mining Conference AttendanceSilver Tiger will be attending the BMO Global Metals, Mining, and Critical Metals Conference from February 23 to February 26, 2025 in Hollywood Florida;Silver Tiger will be attending the PDAC in Toronto from March 2 to March 5, 2025. Our booth number will be 3206; andSilver Tiger will also be attending the Swiss Mining Institute (SMI) in Zurich March 18 and March 19, 2025.About Silver Tiger and the El Tigre Historic Mine DistrictSilver Tiger Metals Inc. is a Canadian company whose management has more than 25 years' experience discovering, financing and building large hydrothermal silver projects in Mexico. Silver Tiger's 100% owned 28,414 hectare Historic El Tigre Mining District is located in Sonora, Mexico. Principled environmental, social and governance practices are core priorities at Silver Tiger.The El Tigre historic mine district is located in Sonora, Mexico and lies at the northern end of the Sierra Madre silver and gold belt which hosts many epithermal silver and gold deposits, including Dolores, Santa Elena and Las Chispas at the northern end. In 1896, gold was first discovered on the property in the Gold Hill area and mining started with the Brown Shaft in 1903. The focus soon changed to mining high-grade silver veins in the area with production coming from 3 parallel veins the El Tigre Vein, the Seitz Kelley Vein and the Sooy Vein. Underground mining on the middle El Tigre vein extended 1,450 meters along strike and was mined on 14 levels to a depth of approximately 450 meters. The Seitz Kelley Vein was mined along strike for 1 kilometer to a depth of approximately 200 meters. The Sooy Vein was only mined along strike for 250 meters to a depth of approximately 150 meters. Mining abruptly stopped on all 3 of these veins when the price of silver collapsed to less than 20¢ per ounce with the onset of the Great Depression. By the time the mine closed in 1930, it is reported to have produced a total of 353,000 ounces of gold and 67.4 million ounces of silver from 1.87 million tons (Craig, 2012). The average grade mined during this period was over 2 kilograms silver equivalent per ton.The El Tigre silver and gold deposit is related to a series of high-grade epithermal veins controlled by a north-south trending structure cutting across the andesitic and rhyolitic tuffs of the Sierra Madre Volcanic Complex within a broad silver and gold mineralized prophylitic alteration zone developed in the El Tigre Formation that can be up to 150 meters wide. The veins dip steeply to the west and are typically 0.5 meter wide but locally can be up to 5 meters in width. The veins, structures and mineralized zones outcrop on surface and have been traced for 5.3 kilometers along strike in our brownfield exploration area. Historical mining and exploration activities focused on a 1.6 kilometer portion of the southern end of the deposits, principally on the El Tigre, Seitz Kelly and Sooy veins. The under explored Caleigh, Benjamin, Protectora and the Fundadora exposed veins continue north for more than 3 kilometers. Silver Tiger has delivered its maiden 43-101 compliant resource estimate and is currently drilling to update its resource estimate and publish a PEA.VRIFY Slide Deck and 3D Presentation - Silver Tiger's El Tigre ProjectVRIFY is a platform being used by companies to communicate with investors using 360° virtual tours of remote mining assets, 3D models and interactive presentations. VRIFY can be accessed by website and with the VRIFY iOS and Android apps.Access the Silver Tiger Metals Inc. Company Profile on VRIFY at:https://vrify.comThe VRIFY Slide Deck and 3D Presentation for Silver Tiger Metals Inc. can be viewed at:https://vrify.com/explore/decks/492and on the Corporation's website at:www.silvertigermetals.com.Procedure, Quality Assurance / Quality Control and Data VerificationThe diamond drill core (HQ size) is geologically logged, photographed and marked for sampling. When the sample lengths are determined, the full core is sawn with a diamond blade core saw with one half of the core being bagged and tagged for assay. The remaining half portion is returned to the core trays for storage and/or for metallurgical test work.The sealed and tagged sample bags are transported to the Bureau Veritas facility in Hermosillo, Mexico. Bureau Veritas crushes the samples (Code PRP70-250) and prepares 200-300 gram pulp samples with ninety percent passing Tyler 200 mesh (Code PUL85). The pulps are assayed for gold using a 30-gram charge by fire assay (Code FA430) and over limits greater than 10 grams per tonne are re-assayed using a gravimetric finish (Code FA530). Silver and multi-element analysis is completed using total digestion (Code MA200 Total Digestion ICP). Over limits greater than 100 grams per tonne silver are re-assayed using a gravimetric finish (Code FA530).Quality assurance and quality control (\"QA/QC\") procedures monitor the chain-of-custody of the samples and includes the systematic insertion and monitoring of appropriate reference materials (certified standards, blanks and duplicates) into the sample strings. The results of the assaying of the QA/QC material included in each batch are tracked to ensure the integrity of the assay data. All results stated in this announcement have passed Silver Tiger's QA/QC protocols.Qualified PersonDavid R. Duncan, P. Geo., V.P. Exploration of the Corporation, is the Qualified Person for Silver Tiger as defined under National Instrument 43-101. Mr. Duncan has reviewed and approved the scientific and technical information in this press release.For further information, please contact:Glenn JessomePresident and CEO902 492 0298This email address is being protected from spambots. You need JavaScript enabled to view it.CAUTIONARY STATEMENT:Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.This News Release includes certain \"forward-looking statements\". All statements other than statements of historical fact included in this release, including, without limitation, statements regarding potential mineralization, resources and reserves, the ability to convert inferred resources to indicated resources, the ability to complete future drilling programs and infill sampling, the ability to extend resource blocks, the similarity of mineralization at El Tigre to Delores, Santa Elena and Chispas, exploration results, and future plans and objectives of Silver Tiger, are forward-looking statements that involve various risks and uncertainties. Forward-looking statements are frequently characterized by words such as \"may\", \"is expected to\", \"anticipates\", \"estimates\", \"intends\", \"plans\", \"projection\", \"could\", \"vision\", \"goals\", \"objective\" and \"outlook\" and other similar words. Although Silver Tiger believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, there can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Important factors that could cause actual results to differ materially from Silver Tiger's expectations include risks and uncertainties related to exploration, development, operations, commodity prices and global financial volatility, risk and uncertainties of operating in a foreign jurisdiction as well as additional risks described from time to time in the filings made by Silver Tiger with securities regulators."
    },
    {
        "title": "IMPACT Silver Intersects 597 g/t Silver over 2.77m and 1,460 g/t Silver over 0.55m on Kena Discovery at Guadalupe Mine",
        "date": "2025-02-11",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/361-tsx-venture/ipt/175066-impact-silver-intersects-597-g-t-silver-over-2-77m-and-1-460-g-t-silver-over-0-55m-on-kena-discovery-at-guadalupe-mine.html",
        "content": "Vancouver, British Columbia--(Newsfile Corp. - February 11, 2025)- IMPACT Silver Corp.(TSXV: IPT) (OTCQB: ISVLF) (FSE: IKL) (\"IMPACT\" or the \"Company\") is pleased to announce further drill results from the new Kena Vein South discovery in its producing Guadalupe silver mine in the Royal Mines of Zacualpan Silver-Gold District, Mexico.KENA VEIN SOUTH UNDERGROUND DRILL RESULTSUnderground drilling from Level 140 of the Guadalupe Mine intersected further significant mineralization on the south extension of the recently discovered Kena Vein South, within 100-200 metres of active mine workings. New assays received include the following:TABLE 1:NEW KENA VEIN SOUTH DRILL RESULTS - GUADALUPE MINEHole No.From (metres)To (metres)Interval (metres)Silver (g/t)Gold (g/t)Lead (%)Zinc (%)MPZ-UG-005-24213.08215.852.77597.01.150.790.61And261.20261.550.35338.00.870.381.68And270.95271.500.551,460.00.040.270.72And278.40279.751.35298.00.030.130.04MPZ-UG-006-24290.00293.703.70195.30.050.190.47Including292.80293.700.90611.00.170.601.34MPZ-UG-007-24207.00207.750.75519.00.540.200.39True widths are interpreted to be 85-100% of drill intervals. Drill results reported in this news release were infill holes on the Kena Vein South to fill a gap in previously reported drilling in preparation for mining (see Table 2 and Figure 1). These results include nearby parallel and splay veins. Additional drilling is planned, surface trenching and sampling of the vein has been completed (assays pending), and new underground access to the Kena Vein South is close to completion to begin mining. The Company intends to continue to maintain a broad exploration program in 2025 and expects to update the market with additional drill results in the coming months.CEO STATEMENTPresident and CEO Fred Davidson commented, \"We are pleased with these additional excellent drill results from the recently discovered Kena Vein South which has now been drilled over 150 metres length and remains open for further drilling. The close proximity of the new vein to current active mine workings has allowed for rapid and low cost mine development. Our mining team is close to completing a new underground access to the vein and it is expected that the first mineral will be mined from Kena South this month. These results are a testament to the Company's ongoing, aggressive exploration program targeting primarily high-grade silver as well as significant gold, lead and zinc values.\"KENA VEIN SOUTH DRILL RESULTS TO DATEThe Kena Vein South has now been drill tested over a length of 150 metres from mine Level 140 and is open for extension to the southeast, updip and downdip. Table 2 below is a compilation of drill results from the zone to date and Figure 1 is a map of drill hole locations:TABLE 2:TOTAL KENA VEIN SOUTH DRILL RESULTS TO DATE - GUADALUPE MINEHole No.From (metres)To (metres)Interval (metres)Silver (g/t)Gold (g/t)Lead (%)Zinc (%)MPZ-UG-009-23193.95194.250.30675.00.000.161.24MPZ-UG-010-23232.50233.801.30232.00.090.100.16And236.00239.403.40190.70.341.432.99Including238.50239.400.90361.00.412.325.07MPZ-UG-011-23221.10247.6526.55168.50.040.120.31Including221.10236.8515.75226.50.050.150.36Including221.10222.751.651,005.00.210.721.10Including229.40231.051.65348.40.050.170.59Including235.30236.851.55407.00.060.170.76MPZ-UG01-2479.4581.101.65377.90.400.270.42And178.10178.850.751,400.00.390.902.09And206.70224.0017.30213.80.020.150.25Including206.70210.603.90357.70.030.180.41And231.80232.100.30782.00.060.130.29MPZ-UG03-24241.62242.400.78463.00.090.631.23And254.00255.201.20198.01.993.315.93MPZ-UG-004-24179.50179.900.401,450.00.652.163.05And263.00263.700.701,615.00.581.836.05MPZ-UG-005-24213.08215.852.77597.01.150.790.61And261.20261.550.35338.00.870.381.68And270.95271.500.551,460.00.040.270.72And278.40279.751.35298.00.030.130.04MPZ-UG-006-24290.00293.703.70195.30.050.190.47Including292.80293.700.90611.00.170.601.34MPZ-UG-007-24207.00207.750.75519.00.540.200.39True widths are interpreted to be 85-100% of drill intervals. These results include nearby parallel and splay veins.ABOUT IMPACT SILVERIMPACT Silver Corp. (TSXV: IPT) is a successful producer-explorer with two mining projects in Mexico.Royal Mines of Zacualpan Silver-Gold District: IMPACT owns 100% of the 211 km2Zacualpan project in central Mexico where four underground silver mines and one open pit mine feed the central 500 tpd Guadalupe processing plant. To the south, the Capire Project includes a 200 tpd processing pilot plant adjacent to an open pit silver mine with an NI 43-101 inferred mineral resource of over 4.5 million oz silver, 48 million lbs zinc and 21 million lbs lead (see IMPACT news release dated January 18, 2016 for details and QP statement). Company personnel are reviewing Capire for a potential restart of operations. Over the past 18 years, IMPACT has placed multiple zones into commercial production and produced over 13 million ounces of silver, generating revenues over $261 million, with no long-term debt.Plomosas Zinc-Lead-Silver District:Plomosas is a high-grade zinc producer in northern Mexico with exceptional exploration upside potential. The Company recently restarted mining operations and is ramping up production toward design capacity levels. Exploration potential at Plomosas is exceptional along a 6 km-long structure with a number of historic mines and mineral prospects. This is in addition to other exploration targets on the 3,019-hectare property including untested copper-gold targets with indications of high-grade material from surface. Regionally, Plomosas lies in the same mineral belt as some of the largest carbonate replacement deposits in the world.Quality Control/Quality AssuranceSamples reported in this news release were analyzed by ALS Group, an internationally recognized analytical services provider, using a multielement ICP package for silver and base metals, and fire assay and AAS for gold. Assays for base metals >1% resorted to an overlimit method. Certified Reference Materials and internal control samples are added to the sample stream at regular intervals to monitor assay quality control.Qualified Person and NI 43-101 DisclosureSilvia Kohler, P.Geo. is a \"Qualified Person\" within the meaning of NI 43-101 and has approved the technical information contained in this news release.Additional information about IMPACT and its operations can be found on the Company website atwww.IMPACTSilver.com. Follow us on X (formerly Twitter) @IMPACT_Silver and LinkedIn athttps://www.linkedin.com/company/impactsilverOn behalf of IMPACT Silver Corp.\"Frederick W. Davidson\"President & CEOFor more information, please contact:Jerry HuangCFO | Investor RelationsO: (604) 681 0172 orThis email address is being protected from spambots. You need JavaScript enabled to view it.C: (778) 887 6489 DirectNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.Forward-Looking and Cautionary StatementsThis IMPACT News Release may contain certain \"forward-looking\" statements and information relating to IMPACT that is based on the beliefs of IMPACT management, as well as assumptions made by and information currently available to IMPACT management. Forward-looking information is often, but not always, identified by the use of words such as \"seek\", \"anticipate\", \"plan\", \"continue\", \"planned\", \"expect\", \"project\", \"predict\", \"potential\", \"targeting\", \"intends\", \"believe\", \"potential\", and similar expressions, or describes a \"goal\", or variation of such words and phrases or state that certain actions, events or results \"may\", \"should\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Such statements include, but are not limited to, statements regarding interpretation of drill results, activity at the projects and estimated timing thereof, the potential for defining and extending the known mineralization, exploration potential on the properties, and plans for drilling and future operations at the Company's projects or plans for financing.Such forward-looking information involves known and unknown risks and assumptions, including with respect to, without limitation, exploration and development risks, expenditure and financing requirements, title matters, operating hazards, criminal activity, metal prices, political and economic factors, competitive factors, general economic conditions, relationships with vendors, strategic partners and local communities, governmental regulation and supervision, seasonality, technological change, industry practices, pandemics and one-time events. Should any one or more risks or uncertainties materialize or change, or should any underlying assumptions prove incorrect, actual results and forward-looking statements may vary materially from those described herein. IMPACT does not assume the obligation to update any forward-looking statement or beliefs, opinions, projections or other factors, except as required by law.The Company's decision to place a mine into production, expand a mine, make other production related decisions or otherwise carry out mining and processing operations, is largely based on internal non-public Company data and reports based on exploration, development and mining work by the Company's technical personnel. The results of this work are evident in the discovery and building of multiple mines for the Company at Zacualpan and in the track record of mineral production and financial returns of the Company since 2006. Under NI 43-101, the Company is required to disclose that it has not based its production decisions on NI 43-101 mineral resources or reserve estimates, preliminary economic assessments or feasibility studies, and historically such projects have increased uncertainty and risk of failure.303-543 Granville Street Telephone 604 664-7707Vancouver, BC, Canada V6C 1X8www.impactsilver.comX (Twitter)LinkedIn"
    }
]