[
    {
        "title": "Silver Storm Mining anuncia un aumento del 107% en los Recursos Minerales Indicados en La Parrilla",
        "date": "11 de febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/433-tsx-venture/svrs/175028-silver-storm-announces-107-increase-in-indicated-mineral-resources-at-la-parrilla.html",
        "content": "La compañía minera Silver Storm anunció un aumento del 107% en los Recursos Minerales Indicados en su complejo minero de plata La Parrilla, ubicado en Durango, México. Los resultados de la Actualización del Estimado de Recursos Minerales incluyen un incremento del 58% en Recursos Minerales Inferidos, así como un aumento significativo en los Recursos Minerales en categoría de óxidos y sulfuros. Este crecimiento sustancial refleja el potencial de expansión y mejora de la operación y respalda la meta de reiniciar la producción en la mina de plata. La modernización de la estimación de recursos incluyó una exhaustiva reinterpretación de las estructuras mineralizadas, resaltando el compromiso de la compañía con las prácticas de excelencia en la industria minera. Los detalles de la estimación están respaldados por un riguroso programa de control de calidad y aseguramiento de calidad, garantizando la fiabilidad de los datos. Para obtener más información sobre los proyectos y el desempeño futuro de Silver Storm Mining Ltd., se puede acceder a su sitio web oficial."
    },
    {
        "title": "Silver Tiger Metals Intersecta 3.0 metros de 1,526.3 g/t de Equivalente de Plata Dentro de 17.3 metros de 309.0 g/t de Equivalente de Plata en la Zona de Sulfuros desde la Estación de Perforación Subterránea",
        "date": "11 de febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1429-tsx-venture/slvr/175032-silver-tiger-intersects-3-0-meters-of-1-526-3-g-t-silver-equivalent-within-17-3-meters-of-309-0-g-t-silver-equivalent-in-the-sulfide-zone-from-underground-drilling-station.html",
        "content": "La compañía Silver Tiger Metals Inc. ha recibido los primeros resultados de ensayos del programa de perforación que se está llevando a cabo desde plataformas de perforación subterráneas, apuntando a las Zonas de Vena, Sulfuro y Pizarra de alto grado en su Proyecto El Tigre de plata-oro (el \"Proyecto\" o \"El Tigre\") ubicado en Sonora, México. Algunos de los puntos destacados del programa de perforación incluyen lo siguiente: El agujero ET-24-627 encontró 3.0 metros con una ley de 1,526.3 g/t de plata equivalente desde 297.5 metros hasta 300.5 metros, y 17.3 metros con 309.0 g/t de plata equivalente desde 297.5 metros hasta 314.8 metros en la Zona de Sulfuros. El agujero ET-23-626 intersectó 4.8 metros con 321.0 g/t de plata equivalente dentro de 17.1 metros con 140.0 g/t de plata equivalente en la Zona de Sulfuros. La compañía continuará perforando para enfocarse en las Zonas de Vena, Sulfuro y Pizarra a corta distancia por debajo de su camino de transporte rehabilitado, proporcionando valiosos datos para los bloques de recursos minerales cercanos a la primera etapa de desarrollo. Estos resultados prometedores reflejan la importancia de las zonas mineralizadas de alto grado en el Proyecto El Tigre y su potencial como un complejo minero de gran tamaño y larga vida útil. Para más información, se puede acceder a los resultados completos de los sondeos en el enlace proporcionado."
    },
    {
        "title": "IMPACT Silver Intersecta 597 g/t de plata en 2.77m y 1,460 g/t de plata en 0.55m en el Descubrimiento de Kena en la Mina Guadalupe",
        "date": "11 de febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/361-tsx-venture/ipt/175066-impact-silver-intersects-597-g-t-silver-over-2-77m-and-1-460-g-t-silver-over-0-55m-on-kena-discovery-at-guadalupe-mine.html",
        "content": "IMPACT Silver Corp. se complace en anunciar nuevos resultados de perforación del descubrimiento de la Vena Kena Sur en su mina productora de plata Guadalupe en el distrito de plata-oro de Zacualpan, México. Los resultados mostraron una mineralización significativa en la extensión sur de la recientemente descubierta Vena Kena Sur, a pocos metros de las labores mineras activas. Algunos de los resultados incluyen 597 g/t de plata en 2.77 metros y 1,460 g/t de plata en 0.55 metros. La vena ha sido probada a lo largo de 150 metros desde el nivel 140 de la mina y permanece abierta para futuras extensiones hacia el sureste, arriba y abajo. IMPACT Silver tiene dos proyectos mineros en México, uno de ellos es el proyecto Zacualpan donde posee cuatro minas subterráneas de plata y una planta de procesamiento, y el otro es el proyecto Plomosas, una mina de zinc-plomo-plata con un alto potencial de exploración. La compañía tiene la intención de continuar con un amplio programa de exploración en 2025. Para más información, visita www.IMPACTSilver.com."
    }
]