[
    {
        "title": "First Majestic Silver Announces 2025 Production and Cost Guidance and Announces Conference Call Details",
        "date": "2025-02-13",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1082-tsx/ag/175195-first-majestic-announces-2025-production-and-cost-guidance-and-announces-conference-call-details.html",
        "content": "Vancouver, British Columbia--(Newsfile Corp. - February 13, 2025) -First Majestic Silver Corp.(NYSE: AG) (TSX: AG) (FSE: FMV) (the\"Company\"or \"First Majestic\") is pleased to announce the Company's consolidated 2025 production and cost guidance for the Company's four producing underground mines in Mexico, namely the Cerro Los Gatos Silver Mine (the Company holds a 70% interest in the Los Gatos Joint Venture that owns the mine), the Santa Elena Silver/Gold Mine, the San Dimas Silver/Gold Mine, and the La Encantada Silver Mine. The Company will be holding a conference call with management at 8:30 a.m. (PT) on Thursday, February 20, 2025, to discuss First Majestic's 2024 financial results and 2025 production and cost guidance.2025 PRODUCTION GUIDANCEIn 2025, the Company expects to achieve total attributable production from its four operating mines in Mexico of between 27.8 to 31.2 million silver equivalent (\"AgEq\") ounces, including 13.6 to 15.3 million ounces of silver. The increase in forecasted silver production compared to 2024 is due to the addition of attributable production from the Cerro Los Gatos Silver Mine as a result of the Company's acquisition of Gatos Silver, Inc. on January 16, 2025, as well as an increase in silver production from Santa Elena, and from La Encantada, following a return to normal operations at La Encantada in the fourth quarter of 2024.A mine-by-mine breakdown of the 2025 production guidance is included in the table below. The Company reports cost guidance to reflect cash costs and all-in sustaining costs (\"AISC\") on a per AgEq attributable payable ounce. The metal price and foreign currency assumptions that were used to calculate the numbers below were: silver: $29.00/oz, gold: $2,500/oz, lead: $0.95/lb., zinc: $1.25/lb. and MXN:USD 19.5:1.2025 Production GuidanceOperationSilver Oz(M)Gold Oz(k)Lead Lbs(M)Zinc Lbs(M)Silver Eqv. Oz (M)Cash Cost($ per AgEq Oz)AISC($ per AgEq Oz)Los Gatos, Mexico (70%)5.0 - 5.63 - 429 - 3247 - 538.4 - 9.411.98 - 12.5615.03 - 15.92Santa Elena, Mexico1.6 - 1.871 - 79--7.7 - 8.614.91 - 15.7118.60 - 19.79San Dimas, Mexico4.3 - 4.855 - 61--9.0 - 10.113.28 - 14.0417.86 - 19.09La Encantada, Mexico2.7 - 3.1---2.7 - 3.120.16 - 21.3225.30 - 26.98Operations Total13.6 - 15.3129 - 14429 - 3247 - 5327.8 - 31.2$14.10 - $14.86$18.17 - $19.35CorporateCorp. G&A and Services------1.72 - 1.92Total Consolidated13.6 - 15.3129 - 14428.7 - 32.047.3 - 52.727.9 - 31.1$14.10 - $14.86$19.89 - $21.27Certain amounts shown may not add exactly to the total amount due to rounding differences.Cash Costs and AISC are non-GAAP measures and are not standardized financial measures under the Company's financial reporting framework. The Company calculates cash costs and consolidated AISC in the manner set out in the table below. These measures have been calculated on a basis consistent with historical periods. For further details, see \"Non-GAAP Measures\" on pages 42 to 52 of the Company's most recently filed Management's Discussion and Analysis (\"MD&A\") for the third quarter of 2024, dated November 7, 2024, available on SEDAR+ atwww.sedarplus.caand on EDGAR atwww.sec.gov.The Company is projecting its consolidated 2025 AISC to be within a range of $19.89 to $21.27 on a per attributable payable AgEq ounce basis. Excluding non-cash items, the Company anticipates its 2025 AISC to be within a range of $19.35 to $20.67 per attributable payable AgEq ounce. An itemized AISC cost table is provided below.All-In Sustaining Cost CalculationFY 2025($ per AgEq oz)Total Cash Costs per Payable Equivalent Silver Ounce14.10 - 14.86General and Administrative Costs1.32 - 1.47Sustaining Development Costs0.94 - 1.00Sustaining Property, Plant and Equipment Costs1.75 - 1.96Profit Sharing0.70 - 0.78Lease Payments0.54 - 0.60Share-based Payments (non-cash)0.40 - 0.45Accretion and Reclamation Costs (non-cash)0.14 - 0.15All-In Sustaining Costs (AgEq Oz)19.89 - 21.27All-In Sustaining Costs: (AgEq Oz excluding non-cash items)19.35 - 20.67AISC is a non-GAAP measure and is calculated based on the Company's consolidated operating performance. Other mining companies may calculate AISC differently as a result of differences in: underlying accounting principles; the definition of \"sustaining costs\"; and the distinction between sustaining and expansionary capital costs. For further details, see \"Non-GAAP Measures\" on pages 42 to 52 of the Company's most recently filed MD&A for the third quarter of 2024, dated November 7, 2024, available on SEDAR+ atwww.sedarplus.caand on EDGAR atwww.sec.gov.Consolidated AISC includes general and administrative cost estimates and non-cash costs of $1.86 to $2.07 per AgEq ounce.CAPITAL INVESTMENTS IN 2025In 2025, the Company plans to invest approximately $182 million in capital expenditures consisting of $80 million for sustaining activities and $102 million for expansionary projects. This represents a 34% increase compared to the revised 2024 capital expenditures guidance driven largely by the addition of the attributable capital expenditures of the Cerro Los Gatos Silver Mine and is aligned with the Company's future growth strategy underpinned by exploration and development activities at Santa Elena and San Dimas.Capital Guidance for 2025AreaSustaining ($M)Expansionary ($M)Total ($M)Underground Development$28$46$74Exploration-$49$49Property, Plant and Equipment$51$5$56Corporate Projects$1$2$3Total$80$102$182The 2025 annual guidance includes total capital investments of $74 million for underground development; $49 million in exploration; $56 million towards property, plant and equipment; and $3 million towards corporate innovation projects. Management may revise the guidance during the year to reflect actual and anticipated changes in metal prices or to the business. There can be no assurance that cost estimates related to the Company's 2025 guidance will prove to be accurate. For further details regarding risks related to the allocation of capital by the Company, see the section in the Company's most recently filed Annual Information Form (\"AIF\") entitled\"Risk Factors - Financial Risks - Allocation of Capital - Sustaining and Expansionary Capital\".The Company is planning approximately 270,000 metres (\"m\") of exploration drilling in 2025, representing a significant increase compared to the 182,932 m completed in 2024. The 2025 drilling program is expected to consist of:At San Dimas, approximately 112,000 m of drilling is planned with infill, step-out and exploratory holes focused on near mine and brownfield targets including major ore controlling structures in the West, Central and Sinaloa blocks. Exploration efforts represent a balanced approach to adding Inferred Resources along known veins, converting Inferred to Indicated Resources and identifying new veins in locations where post mineral cover has deferred work to date. Additionally, the exploration team anticipates returning to the Tayoltita and Santa Rita areas where little to no exploration has taken place in recent years.At Santa Elena, approximately 57,000 m of drilling is planned. Greenfield and brownfield drilling at Santa Elena will focus on several targets within a 5-kilometre radius around the processing plant where new geologic understanding of district stratigraphy has brought to light large areas with exploration upside. First Majestic will continue to drill the Navidad project where both extension and infill drilling are planned.At Cerro Los Gatos, approximately 76,000 m of drilling is planned. Exploration will be focused on testing potential areas for mineralization expansion at the Central Deep and South East targets as well as taking a first step at exploring the wider land package in search of new ore bodies.At Jerritt Canyon, approximately 18,000 m of drilling is planned. Exploration work will be focused on testing the extension of known ore controlling structures below outcropping Upper Plate (cover rock) where the presence of large, mineralized volumes is possible and has been poorly tested to date.The Company plans to complete approximately 35,500 metres of underground development in 2025, compared to 32,047 m completed in 2024. The 2025 development program consists of approximately 14,000 m at San Dimas, 8,100 m at Santa Elena, 7,800 m at Cerro Los Gatos, and 5,600 m at La Encantada. At San Dimas, the Company is planning to concentrate development metres in the Perez, Regina and Elia Veins. At the Santa Elena district, underground development is expected to focus on Ermitaño and the advancement of the Luna ramp. At the Cerro Los Gatos district, development is to take place in all segments (NW, Central and SE) of the mine. At La Encantada, the Company plans to develop the Ojuelas and Milagros ore bodies for 2025 production.CONFERENCE CALL DETAILSThe Company will host a conference call and webcast onThursday, February 20, 2025, at 8:30 a.m. (PT) / 11:30 a.m. (ET)to provide investors and analysts with a business update, and to discuss its 2024 earnings and production results and 2025 guidance.To participate in the conference call, please use the following dial-in numbers:Canada & USA Toll-Free:1-844-763-8274Outside of Canada & USA:+1-647-484-8814Toll-Free Germany:+49-69-17415718Toll-Free UK:+44-20-3795-9972Participants should dial-in at least 15 minutes prior to the start of the call to ensure placement in the conference on time.A live webcast of the call will be accessible through the \"February 20, 2025 Webcast Link\" on the First Majestic home page atwww.firstmajestic.com. A webcast archive will be available approximately one hour after the end of the event and will be accessible for three months through the same link as the live event.A recording of the conference call will be available for telephone replay approximately one hour after the end of the event by calling:USA & Canada Toll-Free:1-855-669-9658Outside of Canada & US:+1-412-317-0088Access Code:7307775The telephone replay will be available for seven days following the end of the event.ABOUT FIRST MAJESTICFirst Majestic is a publicly traded mining company focused on silver and gold production in Mexico and the United States. The Company presently owns and operates four producing underground mines in Mexico: the Cerro Los Gatos Silver Mine (the Company holds a 70% interest in the Los Gatos Joint Venture that owns and operates the mine), the Santa Elena Silver/Gold Mine, the San Dimas Silver/Gold Mine, and the La Encantada Silver Mine, as well as a portfolio of development and exploration assets, including the Jerritt Canyon Gold project located in northeastern Nevada, U.S.A.First Majestic is proud to own and operate its own minting facility, First Mint, LLC, and to offer a portion of its silver production for sale to the public. Bars, ingots, coins and medallions are available for purchase online atwww.firstmint.com, at some of the lowest premiums available.For further information, contactThis email address is being protected from spambots. You need JavaScript enabled to view it., visit our website atwww.firstmajestic.comor call our toll-free number 1.866.529.2807.FIRST MAJESTIC SILVER CORP.\"signed\"Keith Neumeyer, President & CEOCautionary Note Regarding Forward Looking StatementsThis news release contains \"forward‐looking information\" and \"forward-looking statements\" under applicable Canadian and U.S. securities laws (collectively, \"forward‐looking statements\"). These statements relate to future events or the Company's future performance, business prospects or opportunities that are based on forecasts of future results, estimates of amounts not yet determinable and assumptions of management made in light of management's experience and perception of historical trends, current conditions and expected future developments. Forward-looking statements in this news release include, but are not limited to, statements with respect to: the assumptions used by the Company for its 2025 production and cost guidance; statements relating to the Company's capital investments in 2025; the Company's business strategy; future planning processes; commercial mining operations; budgets; the timing and amount of estimated future production, AISC and cash costs; costs and timing of development at the Company's projects; capital projects and exploration activities for 2025 and the possible results thereof; drilling programs in 2025, including potential exploration activities in the Tayoltita and Santa Rita areas; and operations at the Company's 100%-owned and operated minting facility and production of bullion from the mint. Assumptions may prove to be incorrect and actual results and future events may differ materially from those anticipated. Consequently, guidance cannot be guaranteed. As such, investors are cautioned not to place undue reliance upon guidance and forward-looking statements as there can be no assurance that the plans, assumptions or expectations upon which they are placed will occur. All statements other than statements of historical fact may be forward‐looking statements. Statements concerning proven and probable mineral reserves and mineral resource estimates may also be deemed to constitute forward‐looking statements to the extent that they involve estimates of the mineralization that will be encountered as and if the property is developed, and in the case of measured and indicated mineral resources or proven and probable mineral reserves, such statements reflect the conclusion based on certain assumptions that the mineral deposit can be economically exploited. Any statements that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives or future events or performance (often, but not always, using words or phrases such as \"seek\", \"anticipate\", \"plan\", \"continue\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"predict\", \"forecast\", \"potential\", \"target\", \"intend\", \"could\", \"might\", \"should\", \"believe\" and similar expressions) are not statements of historical fact and may be \"forward‐looking statements\".Actual results may vary from forward-looking statements. Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause actual results to materially differ from those expressed or implied by such forward-looking statements, including but not limited to: the duration and effects of global health crises, such as pandemics, on our operations and workforce, and the effects on global economies and society; general economic conditions including inflation risks; actual results of exploration activities; conclusions of economic evaluations; changes in project parameters as plans continue to be refined; commodity prices; variations in ore reserves, grade or recovery rates; actual performance of plant, equipment or processes relative to specifications and expectations; accidents; labour relations; social and labour unrest; relations with local communities; changes in national or local governments; changes in applicable legislation, rules or regulations and the application and enforcement thereof; delays in obtaining approvals or financing or in the completion of development or construction activities; exchange rate fluctuations; requirements for additional capital; government regulation; environmental risks; reclamation expenses; outcomes of pending litigation; limitations on insurance coverage as well as those factors discussed in the section entitled \"Description of the Business - Risk Factors\" in the Company's most recent Annual Information Form for the year ended December 31, 2023 filed with the Canadian securities regulatory authorities under the Company's SEDAR+ profile atwww.sedarplus.ca, and in the Company's Annual Report on Form 40-F for the year ended December 31, 2023 filed with the United States Securities and Exchange Commission on EDGAR atwww.sec.gov/edgar. Although First Majestic has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended.The Company believes that the expectations reflected in these forward‐looking statements are reasonable, but no assurance can be given that these expectations will prove to be correct and such forward‐looking statements included herein should not be unduly relied upon. These statements speak only as of the date hereof. The Company does not intend, and does not assume any obligation, to update these forward-looking statements, except as required by applicable laws."
    },
    {
        "title": "Minaurum Drills Exceptional High-Grade Intercepts at Alamos Silver Project, Including 3.00 m of 3,152 g/t Silver",
        "date": "2025-02-13",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1380-tsx-venture/mgg/175218-minaurum-drills-exceptional-high-grade-intercepts-at-alamos-silver-project-including-3-00-m-of-3-152-g-t-silver.html",
        "content": "Vancouver, British Columbia--(Newsfile Corp. - February 13, 2025) -Minaurum Gold Inc.(TSXV: MGG) (OTCQX: MMRGF) (\"Minaurum\" or \"the Company\") is excited to announce the latest results from its drill program at theAlamos Silver Project(\"Alamos\") in Sonora, Mexico. The program, which is targeting the highly prospective Promontorio vein zone, continues to demonstrate robust silver mineralization, with exceptional intercepts including:3.00 m of 4,173 g/t silver equivalent (\"AgEq\")(AL24-111);6.35 m of 380 g/t AgEq(AL24-110); and5.75 m of 189 g/t AgEq.(AL24-112) (Table 1) (Figures 1, 2, 3).\"These results, which underscore the significant potential of the Alamos project, highlight the consistent high-grade silver mineralization drilled over impressive widths along the 1 km strike length of the Promontorio vein zone,\"stated Darrell Rader, President and CEO of Minaurum Gold,\"Now that considerable assay lab delays have been resolved, we look forward to releasing additional results from Promontorio, including the Tirito area, which returned the headline silver intercept.\"Promontorio Vein ZonePromontorio, along with the Europa vein zone, is one of the high-priority targets in which the Company will establish a maiden resource at the Alamos silver project. The 1 km-long Promontorio vein zone consists of multiple veins including the Veta Grande, Veta del 100, and Veta Las Guijas (see Minaurum news release dated February 6, 2020).Minaurum's drilling is focused on establishing 75- to 100-m spacings between vein intersections, as well as step-out drilling. Assays for the first 5 holes of the campaign were announced on September 19, 2024. These included several high-grade intercepts including:0.70 m of 2,976 g/t AgEq(AL24-105);5.60 m of 368 g/t AgEqand2.55 m of 621 g/t AgEq(AL24-107); and8.45 m of 336 g/t AgEq(AL24-108).The four holes reported in this news release further demonstrate the high-grade continuity of the prior drill holes. Holes AL24-110 and -111 were drilled on a fence in the Tirito area of the of Las Guijas vein, while AL24-112 and -113 were drilled on another fence in the northern part of the Veta Grande (Figures 1 and 2). In the Tirito area, the Las Guijas zone contains two separate and discrete veins. Hole AL24-111 intersected a significant high-grade sub interval returning1.55 m of 7,780 AgEq,which includes0.50 m of 13,995 g/t AgEqand1.05 m of 4,839 g/t AgEq.Mineralized core is shown in Figure 3. The Tirito area will be tested by additional holes during the current drill program.Table 1.Assay highlights of holes AL24-110, -111, -112, and -113. Hole locations are shown in Figure 1. Cross section view in Figure 2. Weight-averaged silver-equivalent grades are based on May 1, 2024 Kitco.com metal prices: Ag $26.90/oz, Au $2,303.00/oz, Cu $4.52/lb, Pb $1.09/lb, Zn $1.43/lb.HoleFrom (m)To (m)Interval (m)Ag g/tAu g/tCu %Pb %Zn %AgEq g/tVeinAL24-11078.8082.403.60320.070.131.035.31255Tiritoincluding81.0082.401.40280.060.160.808.1234082.4083.801.40mine working83.8086.002.201040.100.200.654.60303including83.8084.000.205910.340.593.113.95892106.80108.101.302280.260.903.710.71461130.5136.856.351470.370.571.483.16380including133.70136.102.403230.730.983.416.80799which includes133.70134.550.857901.481.955.449.751,582AL24-11165.8068.803.003,1523.781.119.0210.694,173Tiritoincluding65.8067.351.556,0207.171.8416.2816.367,780which includes65.8066.300.5012,1833.462.6018.2422.4213,955and66.3067.351.053,0868.941.4815.3413.474,83971.8077.806.00760.100.190.932.64215including71.8073.802.00500.210.421.755.05324104.80108.253.452950.230.481.193.23502AL24-112140.90146.655.75860.820.250.100.09189Veta Grande Dios Padreincluding144.05146.652.601151.040.320.140.11244which includes145.85146.650.80462.660.340.050.09314AL24-113159.80160.901.10221.260.150.010.06148Veta Grande Dios Padre165.95166.600.651581.660.230.100.16333Figure 1.Promontorio Vein Zone, 2024 drill program, showing locations of drill intercepts. Click image to enlarge.Figure 2.Cross section of Tirito area, Las Guijas vein, Promontorio zone, looking north-northeast, showing mineralized intercepts in holes AL24-110 and AL24-111. Hole AL20-069 was reported on February 9, 2021. Click image to enlarge.Figure 3.Drill core photo of AL24-111. Mineralized interval 65.80 to 68.80 m assayed4,173 g/t AgEqor3,152 g/t Ag, 3.78 g/t Au, 1.11% Cu, 9.02% Pb, 10.69% Zn. Host rock is skarn- and hornfels-altered limestone. Click image to enlarge.Follow us and stay updated:YouTube:https://www.youtube.com/user/MinaurumGoldX:@minaurumgoldLinkedIn:https://www.linkedin.com/company/minaurum-gold-incSubscribe to our email list atwww.minaurum.comMinaurum Gold Inc. (TSXV: MGG) (OTCQX: MMRGF) (FSE: 78M)is an Americas-focused explorer concentrating on the high-grade, 100% owned, production-permitted Alamos silver project in Sonora, Mexico and a portfolio of district-scale projects in Mexico. Minaurum is managed by one of the strongest technical and finance teams and will continue its founders' legacy of creating shareholder value by acquiring and developing a pipeline of Tier-One precious-and base metal projects.ON BEHALF OF THE BOARD\"Darrell A. Rader\"Darrell A. RaderPresident and CEOFor more information, please contact:Sunny Pannu - Investor Relations and Corporate Development Manager(778) 330 0994 or via email atThis email address is being protected from spambots. You need JavaScript enabled to view it.The TSX Venture Exchange does not accept responsibility for the adequacy or accuracy of this news release.1570- 200 Burrard StreetTelephone: 1 778 330-0994Vancouver, BC V6C 3L6www.minaurum.comThis email address is being protected from spambots. You need JavaScript enabled to view it.Data review and verificationStephen R. Maynard, Vice President of Exploration of Minaurum and a Qualified Person (QP) as defined by National Instrument 43-101, reviewed and verified the assay data, and has approved the disclosure in this News Release. Verification was done by visual inspection of core samples and comparison to assay results. Assay results have not been checked by re-analysis. No factors were identified that could materially affect the accuracy or reliability of the data presented in this news release.Analytical Procedures and Quality Assurance/Quality ControlPreparation and assaying of drilling samples from Minaurum's Alamos project are done with strict adherence to a Quality Assurance/Quality Control (QA/QC) protocol. Core samples from the 2024 program are sawed in half and then bagged in a secure facility near the site, and then shipped by a licensed courier to ActLabs preparation facility in Zacatecas, Zacatecas, Mexico. ActLabs prepares the samples, crushing them to 70% less than 2mm, splitting off 250g, and pulverizing the split to more than 85% passing 75 microns. The resulting sample pulps are prepared in Zacatecas, and then shipped to Vancouver for chemical analysis by ActLabs. The pulps are analyzed for gold by fire assay and ICP/AES on a 50-gram charge. In addition, analyses are done for a 48-element suite using 4-acid digestion and ICP analysis. Samples with silver values greater than 100 g/t; and copper, lead, or zinc values greater than 10,000 ppm (1%) are re-analyzed using 4-acid digestion and atomic absorption spectrometry (AAS).Quality-control (QC) samples are inserted in the sample stream every 20 samples, and thus represent 5% of the total samples. QC samples include standards, blanks, and duplicate samples. Standards are pulps that have been prepared by a third-party laboratory; they have gold, silver, and base-metal values that are established by an extensive analytical process in which several commercial labs (including ActLabs) participate. Standards test the calibration of the analytical equipment. Blanks are rock material known from prior sampling to contain less than 0.005 ppm gold; they test the sample preparation procedure for cross-sample contamination. In the case of duplicates, the sample interval is cut in half, and then quartered. The first quarter is the original sample, the second becomes the duplicate. Duplicate samples provide a test of the reproducibility of assays in the same drilled interval.When final assays are received, QC sample results are inspected for deviation from accepted values by the QP. To date, QC sample analytical results have fallen in acceptable ranges on the Alamos project.ActLabs is independent of Minaurum Gold and is independent of the Qualified Person.Cautionary Note Regarding Forward Looking InformationThis news release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation. \"Forward-looking information\" includes, but is not limited to, statements with respect to activities, events or developments that the Company expects or anticipates will or may occur in the future. Generally, but not always, forward-looking information and statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or \"believes\" or the negative connotation thereof or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\" or the negative connotation thereof.In making the forward-looking information in this release, Minaurum has applied certain factors and assumptions that are based on Minaurum's current beliefs as well as assumptions made by and information currently available to Minaurum. Although Minaurum considers these assumptions to be reasonable based on information currently available to it, they may prove to be incorrect, and the forward-looking information in this release are subject to numerous risks, uncertainties and other factors that may cause future results to differ materially from those expressed or implied in such forward-looking information.Readers are cautioned not to place undue reliance on forward-looking information. Minaurum does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by law."
    },
    {
        "title": "Sonoran Desert Copper 2024 Compilation Work Results on the Cuatro Hermanos Copper Project",
        "date": "2025-02-13",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/2749-tsx-venture/sdcu/175213-sonoran-desert-copper-corporation-2024-compilation-work-results-on-the-cuatro-hermanos-copper-project.html",
        "content": "Vancouver, British Columbia--(Newsfile Corp. - February 13, 2025) -Sonoran Desert Copper Corporation(TSXV: SDCU) (\"SDCU'' or the \"Company\") is pleased to announce it has completed the compilation of the geophysical data sets and correlated the drillhole database with the geophysical anomalies from the historical data of Induced Polarization (IP) and Electrical Resistivity (ER) of the Cuatro Hermanos Project1,2,3. The work summarizes the geophysical analyses of resistivity and induced polarization (IP) data, which consisted of four sections, conducted over the Cuatro Hermanos copper project (4H Copper Project). The survey aimed to delineate the IP anomalies, with a focus on copper and molybdenum mineralization. The updated resistivity and IP profiles provide enhanced visualization, crucial for characterizing the deposit anomalies and supporting further drilling of untested high-profile copper targets within the project area. The geophysical compilation work was executed by the experienced Fabrício Santos, MSc. In Geophysics.HIGHLIGHTSIdentification of deep shear zones in IP and Resistivity sections, acting as possible channels for sulphide-rich mineralizing fluids as the source of the copper mineralization at the 4H Copper Project. Geoelectrical Line 1 shows the continuity of a possible shear zone to the east (Figure 3).Evidence of mineralization associated with sulphides in IP anomalies, indicating potential for copper concentration in the shear structures at depth.Drillholes close to the anomalies in the West Zone indicates that copper is grading into the direction of these structures, suggesting these drillholes may be proximal to these untested zones.The 4H Copper Project is in Sonora, Mexico, and comprises nine concessions totalling 2,825 hectares and contains a large porphyry copper-molybdenum system with surface measurements of at least four kilometres east-west by two kilometres north-south. The Company released a recent NI43-101 report on the 4H Project in October 2023.Primary sulphide mineralisation is chalcopyrite and molybdenite with secondary oxide chalcocite.The 4H Copper Project (Figure 1) has 123 drill holes. 70 holes with associated geochemical analyses for copper and molybdenum were identified. Thus, 70 strip logs were created with geochemical data for these two elements when available. Some holes had their samples composited.Figure 1Location of the project and drillholes.Figure 2shows a block model with the topography and IP sections positioned along the study area to evaluate the positions of the geophysical anomalies and their association with the known areas of copper mineralization.Figure 2Study area block Model and IP sections.The geoelectric response over Line 1 indicates the presence of a structure similar to a shear zone in the west-east direction. The structure intersects the Main Zone (the basis of the current resource at the 4H Copper Project) in the subsurface and suggests continuity of the shear zone to the east. An evaluation of the copper content (%) of Drill Hole CHDD04-08 indicates increased values over the structure.InFigure 3below, which integrates the IP section with the position of hole CHDD04-08 and the copper concentration profile (%), is shown in detail. The association of this information shows the existence of the interpreted shear zone, where possible circulation of metal-rich fluids along this zone may occur.Figure 3IP Section Line 1 and associated drillhole CHDD04-08.The IP/resistivity section of lines 2 and 4 inFigure 4below, show where structures similar to deep shear zones are observed. Deep shear zones are highly significant in copper exploration, especially in hydrothermal systems. These zones can act as conduits for the circulation of metal-rich fluids and facilitate the transport and deposition of copper and other sulphides. In the IP sections, the presence of high IP associated with these deep shear zones may indicate concentrations of sulphide minerals. These anomalies suggest that the shear zones played not only a structural but also a mineralizing role, allowing copper to be deposited along these fractures and possibly in adjacent zones.Drill Holes in the West Zone are close to the anomaly and with indication of possible increases in copper grades in the direction of the anomaly. However, no drill hole has intercepted these anomalies to date.The integrated result suggests that future drilling should focus on these higher potential zones, aiming to confirm and delineate the extension and grade of copper and molybdenum along these structures.Figure 4Study area IP/resistivity section lines 2 and 4.Further to the News Release of November 20, 2024, the company will modify the terms of the non-brokered private placement financing for aggregate gross proceeds of up to $750,000. The updated financing will consist of up to 10,000,000 units at 10 cents for aggregate gross proceeds of up to $1,000,000, with each unit consisting of one common share of the company and one common share purchase warrant with each warrant being exercisable for an additional common share at an exercise price of 15 cents for 24 months. The warrants will be subject to the right of the company to accelerate the exercise of the warrants if the shares of the company trade at or above $0.50 for a period of 10 consecutive trading days. Finders' fees in accordance with TSX Venture Exchange policies may apply to the financing. All securities issued pursuant to the financing will be subject to a four-month hold. Proceeds from the financing will be used for project payments, continuing development of the company's projects and general working capital.Qualified Person StatementThe technical contents of this release were revised and approved by Andre L. Costa, P.Geo., FAIG, a Qualified Person as defined by National Instrument 43-101 and an independent consultant to the Company.References:MineOro Explorations LLC., 2023, Technical Report for the Cuatro Hermanos Cu-Mo-Ag Porphyry Deposit and Project: Suaqui Grande, Sonora, Mexico, Report prepared for Sonoran Desert Copper Corporation, Report Date: October 8, 2023, Prepared & Endorsed by QP(s): Michael Feinstein, PhD, AIPG-CPG #12031 of Kingman, Arizona, USA and Jocelyn Pelletier, MS PGeo-OGQ #961, of Montreal, Quebec, Canada.A.C.A. Howe International Ltd., 2006, Technical Report on the Cuatro Hermanos Copper- Molybdenum Project, Sonora State, Mexico: report for Virgin Metals, Inc., Rept. #894, A.C.A. Howe International Ltd., Toronto, by Priesmeyer, S.T. and Leroux, D.C.CAM Technical Report, 2008, Technical Report Cuatro Hermanos Porphyry Copper-Molybdenum Project Sonora, Mexico: report for Virgin Metals, Inc., Report #087118, C.A.M. LLC, USA, by Nielsen, R., and Sandefur, R.ABOUT SONORAN DESERT COPPER CORPORATIONSonoran Desert Copper Corporation is focused on securing, developing and monetizing energy materials assets and technologies to build shareholder value.On behalf of the Board of Directors ofSONORAN DESERT COPPER CORPORATION\"Brian Leeners\"Brian Leeners, CEO & DirectorThis email address is being protected from spambots. You need JavaScript enabled to view it./ +1 604-862-4184 (WhatsApp)FOR THE ADEQUACY OR ACCURACY OF THIS RELEASEThe information contained herein contains \"forward-looking statements\" within the meaning of applicable securities legislation. Forward-looking statements relate to information that is based on assumptions of management, forecasts of future results, and estimates of amounts not yet determinable. Any statements that express predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance are not statements of historical fact and may be \"forward-looking statements.Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release."
    }
]