[
    {
        "title": "Kootenay Silver Drill Results from Columba Project Chihuahua, Mexico: Highs to 1,455 gpt Silver and 2.99% Lead-Zinc",
        "date": "2025-02-12",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/621-tsx-venture/ktn/175121-drill-results-from-columba-project-chihuahua-mexico-highs-to-1-455-gpt-silver-and-2-99-lead-zinc.html",
        "content": "VANCOUVER, BC,Feb. 12, 2025/CNW/ -Kootenay Silver Inc.(TSXV: KTN)(the \"Company\" or \"Kootenay\")is pleased to provide results from eleven new drill holes at the Columba High Grade Silver Project. The batch reported herein comprises tests from the F and I-Veins and the first holes into a new target area La Preciosa. The next release will detail results from ongoing drilling at the D Vein.Drill Highlights include; See links tooverall plan mapand plan maps ofF Vein,I Vein, and theLa Preciosa/E Vein area.F VeinHole CDH-24-184Hit an old working at the F vein projection. Intercepteda hanging wall vein grading 411 gpt silver, 0.184% lead, and 0.323% zinc over 0.63 meters drill length from63.15mdownhole.Hole CDH-24-186522 gpt silver, 0.46% lead, and 0.8% zinc over 2.33 meters core length within 21 meters of 126 gpt silver from 142.67 meters downhole.Plus 5 other veinsFootwall490 gpt silver over 0.95 meters from 37.23 meters downhole214 gpt silver over 1.24 meters from 96.76 meters downholeHanging Wall511 gpt silver over 1 meter core length from 177 meters downhole607 gpt silver over 1 meter core length from 194 meters downhole457 gpt silver over 1 meter core length within a 5.75 meter zone grading 218 gpt silver from 230.25 meters downholeCDH-24-186 fills a gap in dip of 100 meters with high grades found previously up dip and down dip in CDH-19-010 and CDH-21-090 plus five high grade veins on either side of F Vein.I VeinHole CDH-24-185Two zones207 gpt silver, 0.11 % lead and 0.36% zinc over 5.53 meters core length from 93 meters downhole, includes;394 gpt silver, 0.06% lead, and 0.29% zinc over 0.46 meters core length from 95.54 meters downhole263 gpt silver, 0.31 % lead, and 1.37 % zinc over 0.56 meters from 142.93 meters downholeCDH-24-188Four zones551 gpt silver, 0.6% lead, 0.49% zinc over 3.73 meters core length from 76 meters downhole155 gpt silver, 0.2% lead, 0.7% zinc over 5 meters core length from 139 meters downhole139 gpt silver, 4.33% lead, and 1.71% zinc over 4.2 meters core length from 233.8 meters downhole, includes;440 gpt silver, 10% lead, 0.05% zinc over 1 meter core length from 236 meters downhole38 gpt silver over 11 meters core length from a deeper alteration zone starting at 300 meters downhole.CDH-24-194Three zones119 gpt silver over 1.0 meters core length from 120 meters downhole1455 gpt silver, 0.78% lead, 2.21% zinc over 0.5 meters core length from 219.2 meters downhole181 gpt silver,3.92% lead, 5.83% zincfrom 0.88 meters core length from 278.12 meters downholeLa PreciosaLa Preciosa is an outcropping structure that shows a pattern of improving grades with depth. A pattern seen across Columba that is well documented by drilling at the D and F Veins. This pattern is illustrated in holes CDH 24-187 and 189 wheregrades at surface of less than 1 ppm silversequentiallyincrease to 55 gpt silver ~ 100 meters below surface and again to 2 meters of 75 gpt silver ~ 180 metersbelow surface (see cross section). Similarly, an increase in barium, antimony, lead, and zinc can be seen with increasing depth.All of which indicates potential for high grades at depth along the structure.The La Preciosa silicified breccia outcrop can be traced from the E Vein for450mmeters to the southeast. The breccia forms a low northwest trending cliff that is 250 meters northeast of and parallel to the southeastern extension of J Vein as mapped on surface.Kootenay's President & CEO,James McDonaldstates, \"Recent holes on the F Vein to fill large drill gaps have intersected similar and slightly better grades than previous holes, a positive sign for future infill drilling. In the case of the I-Vein and Preciosa structure they both represent excellent targets for discovery of additional high grade mineralized shootsso keep an eye out for follow up drilling.\"Current batch of drill results from drill holes CDH-24-184 to 194 are tabulated below. Drill highlights, maps, and sections from the project are tabulated on the Company's website at the links belowClick to view thelong sectionsand cross sections (F Vein,I Vein,La Preciosa).Hole IDFrom(meters)To(meters)Interval(meters)E.t.w.1SilvergptPb%Zn%Geologic IntersectionCDH-24-18463.1563.780.630.504110.1840.323HW to F VEINCDH-24-18593.0098.535.534.942070.110.36I VEININCL95.5496.000.460.413940.060.29I VEIN -AND142.93143.490.560.502630.311.37Qz Ca Vein FW to I VEINCDH-24-18637.2338.180.950.464900.560.458FW to F VeinAND96.7698.001.240.602140.150.33FW to F VEINAND129.00150.0021.0010.201260.100.20F VEIN StructureINCL142.67145.002.331.135220.460.80F VEINAND177.00178.001.000.495110.201.20HW Vein to F VEINAND194.00195.001.000.496070.240.78HW Vein to F VEINAND230.25236.005.752.792180.090.18HW Vein to F VEININCL233.00234.001.000.494570.090.35HW Vein to F VEINCDH-24-18777.2877.950.670.54550.010.04La PreciosaCDH-24-18876.0079.733.731.875510.600.49I VEINAND139.00144.005.002.501550.200.71Breccia zone with QzBa veiningAND233.80238.004.202.101394.331.71Veining FW to I VEININCL236.00237.001.000.5044010.000.05Veining FW to I VEINAND300.00311.0011.005.50380.030.03Alteration ZoneCDH-24-189141.00143.002.001.34750.040.03PreciosaCDH-24-190nosignificantinterceptPreciosaCDH-24-191154.10157.002.902.09260.020.01PreciosaCDH-24-19221.1922.150.960.481210.070.09HW to I VEINAND168.00170.002.001.001580.020.52I VEINAND192.00194.002.001.001460.080.28FW to I VEINCDH-24-193120.45121.000.550.41320.020.01Preciosa / E veinCDH-24-194120.00121.001.000.501190.010.02HW to I VEINAND219.20219.700.500.2514550.782.21I VEINAND278.12279.000.880.441813.925.83FW to I VEIN1Estimated true widths are based on current interpretation of mineralized structures. I vein true widths are not well known at this time.Two holes targeted F Vein within a zone of historical workings to fill gaps in the existing vein model. Hole CDH-24-184 intercepted a well mineralized hangingwall vein (values reported herein), before the hole encountered historical mine workings and was terminated before reaching target. Drillhole CDH-24-186 was drilled from the north side of F Vein and intercepted several mineralized intervals including the expected projection of F Vein.I-Vein trends east-northeast from an intersection with F Vein just west of the main historical shaft to an intersection with the projection of J Vein some 620 meters distant. Four holes were drilled to test large gaps in the existing drilling on this structure.CDH-24-185 was drilled near the southwestern end of the structure and encountered the mineralized vein as expected. Hole CDH-24-188 collared northeast of hole 185 and intercepted broad zones of very strong clay and silica alteration in a hydrothermal breccia known locally as \"breccia negra\". Significant silver values along with high base metals are seen. The alteration is atypical of the project and may indicate proximity to deeper and hotter fluid/metal sources.Hole CDH-24-192 and CDH-24-194 were drilled from a common pad and represent the northeastern extent of testing of the I Vein structure to date. These holes drilled close to outcropping breccia negra and encountered that lithology as well as the commonly occurring rhyolite host rock and dioritic intrusive. A high-grade intercept of0.5 meters grading 1455 gpt Ag, 0.78% Pb, and 2.21% Znwas returned from a barite-quartz veinlet hosted within diorite from a depth of 219.2 meters downhole. Exploration potential along the I-Vein is considered very good and further drilling is needed.The balance of holes reported herein represent exploration holes on a new structure mapped on surface known as \"La Preciosa\".The current drill program is nearing the end of its current 20,000 meters which commenced in 2024. The current program forms part of a 50,000-meter staged drill program and is designed to provide sufficient data to allow calculation of a maiden mineral resource estimate.A comprehensive list of drill results completed on the Columba Property since 2019 may be viewed here:Columba Drill Results.About Columba ProjectThe Columba project is a classic high grade epithermal vein system. That management believes is a newly recognized vein district. It is typical in character and size of other vein districts inMexicoknown to have deposited significant resources of silver or gold such as La Chispas andPanuco.Hosted within a volcanic caldera setting, the surface extent of mapped veins measures roughly 4 kilometres by 3 kilometres. Vein mineralization occurs over a minimum vertical extent of 350 meters as shown by drilling. The veins appear to be intermediate sulfidation veins indicating the potential for depths exceeding 700 meters of vertical extent. This remains to be tested and all veins remain open to depth.The veins cut every known rock type on the project and the veins or vein structures can be traced across the highest elevations of the caldera. This indicates veins formed late in caldera history. As elevation increases vein development becomes irregular eventually being replaced by breccias at the higher elevations. Silver grades diminish with increasing elevation right down to background values. Correspondingly silver grades increase with depth from background at higher elevations to highs of kilograms per tonne at depth. It is evident from these features that the vein system has undergone almost no erosion and so whatever silver was deposited originally is largely still there.A general rule of thumb on the project is at levels deeper than 1,750 meters above sea level is where good grades begin to appear. This is what is referred to as the grade line.Prior to Kootenay Silver no exploration had occurred at Columba in nearly 40 years. Historically there were two periods of mining on one of the veins referred to as the F Vein. The first being in the early 1900's when underground development included 6 drifts (tunnels) at different levels coming off a 200-meter-deep shaft. This work was halted by the Mexican Revolution. Then a second brief period of mining occurred around 1958 to 1960 when a small private company used the old development to mine. It is estimated that around 100,000 tonnes were mined.Kootenay acquired 100% of the project and has completed detailed mapping, lidar, and airborne magnetic surveys along with over 49,000 meters of drilling in over 200 holes across various veins. The company also has a 24-year surface access agreement that includes annual and other payments and allows for both exploration and exploitation. The agreement covers all the mineralized areas drilled to date.Sampling and QA/QC at ColumbaAll technical information for the Columba exploration program is obtained and reported under a formal quality assurance and quality control (\"QA/QC\") program. Samples are taken from core cut in half with a diamond saw under the direction of qualified geologists and engineers. Samples are then labeled, placed in plastic bags, sealed and with interval and sample numbers recorded. Samples are delivered by the Company to ALS Minerals (\"ALS\") in Chihuahua. The Company inserts blanks, standards and duplicates at regular intervals as follows. On average a blank is inserted every 100 samples beginning at the start of sampling and again when leaving the mineral zone. Standards are inserted when entering the potential mineralized zone and in the middle of them, on average one in every 25 samples is a standard. Duplicates are taken in the mineralized intervals at an average 2 duplicates for each hole.The samples are dried, crushed and pulverized with the pulps being sent airfreight for analysis by ALS inVancouver, B.C.Systematic assaying of standards, blanks and duplicates is performed for precision and accuracy. Analysis for silver, zinc, lead and copper and related trace elements was done by ICP four acid digestion, with gold analysis by 30-gram fire assay with an AA finish. All drilling reported is HQ core and was completed by Globextools, S.A. de C.V. of Hermosillo,Sonora, Mexico.Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.Qualified PersonsThe Kootenay technical information in this news release has been prepared in accordance with the Canadian regulatory requirements set out in National Instrument 43-101 (Standards of Disclosure for Mineral Projects) and reviewed and approved on behalf of Kootenay by Mr. Dale Brittliffe, BSc. P. Geol., Vice President, Exploration of Kootenay Silver, is the Company's nominated Qualified Person pursuant to National Instrument 43-101, Standards for Disclosure for Mineral Projects, has reviewed the scientific and technical information disclosed in this news release. Mr. Brittliffe is not independent of Kootenay Silver.About Kootenay Silver Inc.Kootenay Silver Inc. is an exploration company actively engaged in the discovery and development of mineral projects in the Sierra Madre Region ofMexico. Supported by one of the largest junior portfolios of silver assets inMexico, Kootenay continues to provide its shareholders with significant leverage to silver prices. The Company remains focused on the expansion of its current silver resources, new discoveries and the near-term economic development of its priority silver projects located in prolific mining districts inSonora, State and Chihuahua, State,Mexico, respectively.CAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTSThe information in this news release has been prepared as atFebruary 11, 2025. Certain statements in this news release, referred to herein as \"forward-looking statements\", constitute \"forward-looking statements\" under the provisions of Canadian provincial securities laws. These statements can be identified by the use of words such as \"expected\", \"may\", \"will\" or similar terms.Forward-looking statements are necessarily based upon a number of factors and assumptions that, while considered reasonable by Kootenay as of the date of such statements, are inherently subject to significant business, economic and competitive uncertainties and contingencies. Many factors, known and unknown, could cause actual results to be materially different from those expressed or implied by such forward-looking statements. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date made. Except as otherwise required by law, Kootenay expressly disclaims any obligation or undertaking to release publicly any updates or revisions to any such statements to reflect any change in Kootenay's expectations or any change in events, conditions or circumstances on which any such statement is based.Cautionary Note to US InvestorsThis news release includes Mineral Reserves and Mineral Resources classification terms that comply with reporting standards inCanadaand the Mineral Reserves and the Mineral Resources estimates are made in accordance with National Instrument 43-101 – Standards of Disclosure for Mineral Projects (\"NI 43-101\"). NI 43-101 is a rule developed by the Canadian Securities Administrators that establishes standards for all public disclosure an issuer makes of scientific and technical information concerning mineral projects. These standards differ significantly from the requirements adopted by the U.S. Securities and Exchange Commission (the \"SEC\"). The SEC sets rules that are applicable to domesticUnited Statesreporting companies. Consequently, Mineral Reserves and Mineral Resources information included in this news release is not comparable to similar information that would generally be disclosed by domestic U.S. reporting companies subject to the reporting and disclosure requirements of the SEC. Accordingly, information concerning mineral deposits set forth herein may not be comparable with information made public by companies that report in accordance with U.S. standards."
    },
    {
        "title": "Outcrop Silver Extends High-Grade Vein System Footprint To More Than 500 Metres With Step-Out Drilling Along Strike at La Ye Vein System",
        "date": "2025-02-12",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1342-tsx-venture/ocg/175120-outcrop-silver-extends-high-grade-vein-system-footprint-to-more-than-500-metres-with-step-out-drilling-along-strike-at-la-ye-vein-system.html",
        "content": "VANCOUVER, BC,Feb. 12, 2025/CNW/ -Outcrop Silver & Gold Corporation(TSXV: OCG) (OTCQX: OCGSF) (DE: MRG)(\"Outcrop Silver\")is pleased to announce recent high-grade results from La Lupe vein, part of La Ye vein system, at its 100%-owned Santa Ana high-grade silver project inColombia. Step-out drilling has significally extended La Ye vein system footprint to over 500 metres along strike, with La Lupe vein – an integral part of the system – now confirmed for more than 200 metres along strike. This results reinforce the system's scalability and high-grade potential.Drilling HighlightsHole DH433 intercepted 0.82 metres grading 686 grams per tonne of silver equivalent in the recently discovered La Lupe vein (Table 1).Multiple narrow splays from the La Lupe vein showing high-grade potential at depth up to 734 grams per tonne of silver equivalent in hole DH435 (Table 1).Drilling at La Ye target, focusing on La Lupe vein, has extended the entire vein system footprint for more than 500 metres along strike and confirmed the Lupe vein for more than 200 metres on strike (Figure 1).\"The discovery and extension of La Lupe vein within La Ye system is an exciting breakthrough for the Santa Ana project. With intercepts grading 1,233 grams per tonne silver equivalent, La Lupe vein not only confirms the high-grade potential of this system but also highlights the scalability of Santa Ana's vein systems,\" commentsGuillermo Hernandez, Vice President of Exploration. \"Extending the footprint of La Ye vein system to over 500 metres along strike is a testament to the project's capacity to deliver transformative results. We are thrilled with the progress and confident in the untapped potential that remains within this prolific district.\"These results confirm that La Lupe vein, a newly discovered structure within La Ye vein system, is a significant contributor to the project's expanding resource potential. Step-out drilling has now extended La Ye vein system to over 500 metres along strike, with La Lupe vein itself confirmed to  over 200 metres along strike. Additionally, newly identified high-grade splays at depth further support the system's potential for additional mineralization (Figure 1). Outcrop Silver's systematic step-out drilling strategy at high-priority targets such as La Ye continues to deliver significant expansion of the Santa Ana project's mineralized footprint. These results highlight Santa Ana's potential for continued resource growth and reaffirm its position as a premier high-grade silver project.TargetHole IDFrom(m)To(m)Interval(m)Estimated True Width(m)Aug/tAgg/tAgEq1g/tVeinLa YeDH42760.6561.100.450.370.58172215La LupeDH43057.0757.370.300.230.31142165La LupeDH43175.0375.330.300.281.6352174VeinDH431184.41185.320.910.861.12141225La LupeIncluding184.41184.720.310.292.58354548DH433201.17201.470.300.230.88196262VeinDH433216.34217.160.820.640.43654686La LupeIncluding216.71217.160.450.350.651,1841,233DH435195.66196.140.480.420.63118166La LupeDH435200.62200.920.300.260.25233252La LupeDH435204.12204.420.300.267.24190734La LupeTable 1.Drill hole assay results reported in this release.Figure 1.Plan view of La Ye vein target showing the drill holes reported in this release (Table 1), previous drilling, and samples previously reported (Table 2). For details on previous drill holes, refer to news releases datedOctober 8, 2024,November 19, 2024andJanuary 06, 2025.Recent drilling on La Lupe vein includes hole DH431, which intercepted 0.91 metres at 225 g/t AgEq, including a high-grade section of 0.31 metres at 2.58 g/t Au and 354 g/t Ag, and hole DH433, which returned 0.82 metres at 686 g/t AgEq, including 0.45 metres at 1,233 g/t AgEq (Table 1). These results confirm the presence of high-grade mineralization more than 150 metres from surface (Figure 2).Figure 2.West to east geological cross-sections showing La Ye vein system.SampleEasting(m)Northing(m)Elevation(m)SampleTypeWidth(m)Aug/tAgg/tAgEq1g/tRelease Date15604504063.000560203.000991.13Chip13.214621,454August 23, 202215605503959.535560159.3631004.98Channel0.405.482,1412,553August 23, 202215606503931.000560137.0001006.49Chip5.689541,381August 23, 202215611503885.000560352.0001023.17Chip7.11458992August 23, 202216182504271.000560431.000998.81Chip5.551,0131,430August 23, 202216184504172.000560416.0001004.64Chip3.258281,073August 23, 202217604503879.000560196.0001039.00Chip2.44291474January 6, 202517606503801.000560221.0001055.00Chip5.997421,192January 6, 202517925503884.000560143.0001052.00Chip0.206.73431936November 19, 2024Table 2.Channel and chip sample results in La Ye vein target from the target generation program previously reported and referred to in Figure 1 (see News Releases datedAugust 23, 2022,November 19, 2024, andJanuary 6, 2025).Hole IDHole CodeEasting(m)Northing(m)Elevation(m)Depth(m)Azimuth(°)Dip(°)DH402SALY24DH402503816.948560141.5711038.15119.78135-55DH404SALY24DH404503816.656560141.8471038.05145.45135-81DH405SALY24DH405503813.641560141.3091038.04154.22224-70DH407SALY24DH407503816.948560141.5711038.15136.5586-61DH408SALY24DH408503759.371560189.5901046.62207.26129-70DH410SALY24DH410503759.107560189.8241046.40246.91129-80DH413SALY24DH413503757.902560189.8321046.39228.29181-75DH414SALY24DH414503759.417560190.9801046.39281.0293-60DH416SALY24DH416503906.552560213.7261026.21157.27135-50DH418SALY24DH418503906.973560215.1171026.34163.0697-56DH419SALY24DH419503904.946560213.2481026.47120.48179-45DH421SALY24DH421503905.704560214.7731026.57198.12135-81DH422SALY24DH422503825.744560270.5941046.26245.36122-65DH424SALY24DH424503826.182560270.9571046.51290.16111-77DH426SALY24DH426504045.744560349.5351011.06138.37137-45DH427SALY24DH427504046.137560349.1001010.90149.04137-67DH429SALY24DH429504046.120560350.2551010.74113.080-90DH430SALY24DH430504043.409560350.0981010.70151.48101-52DH431SALY25DH431503948.920560450.6811033.18269.44137-48DH433SALY25DH433503948.629560450.9151033.14230.42137-64DH435SALY25DH435503948.365560450.2131033.53290.77174-47Table 3.Collar and survey table for drill holes reported and referred to in this release. All coordinates are UTM system, Zone 18N, and WGS84 projection.1Silver equivalentMetal prices used for equivalent calculations wereUS$1,800/oz for gold, andUS$25/oz for silver. Metallurgical recoveries based on Outcrop Silver's metallurgical test work are 97% for gold and 93% for silver (see news release datedAugust 23, 2023). The equivalency formula is as follows:QA/QCFor exploration core drilling, Outcrop Silver applied its standard protocols for sampling and assay. HQ-NTW core is sawn with one-half shipped. Core samples were sent to either ALS, Actlabs or SGS inMedellin, Colombia, for preparation. Samples delivered to Actlabs were AA assayed on Au, Ag, Pb, and Zn atMedellinusing 1A2Au, 1A3Au, Multi-elements AR (Ag Cu Pb Zn), and Code 8 methods. Then, samples were sent to Actlabs Mexico for ICP-multi-elemental analysis with code 1E3. After preparation, the samples sent to ALS Colombia were shipped to ALS Lima for assaying using Au-ICP21, Au-GRA21, ME-MS41, Ag-GRA21, Ag-AA46, Pb-AA46, and Zn-AA46 methods. In line with QA/QC best practices, blanks, duplicates, and certified reference materials are inserted at approximately three control samples every twenty samples into the sample stream, monitoring laboratory performance. A comparison of control samples and their standard deviations indicates acceptable accuracy of the assays and no detectible contamination. No material QA/QC issues have been identified with respect to sample collection, security and assaying. The samples are analyzed for gold and silver using a standard fire assay on a 30-gram sample with a gravimetric finish for over-limits. Multi-element geochemistry was determined by ICP-MS using either aqua regia or four acid digestions. Crush rejects, pulps, and the remaining core are stored in a secured facility at Santa Ana for future assay verification.Qualified PersonEdwin Naranjo Sierrais the designated Qualified Person within the meaning of the National Instrument 43-101 and has reviewed and verified the technical information in this news release. Mr. Naranjo holds a MSc. in Earth Sciences, and is a Fellow of the Australasian Institute of Mining and Metallurgy (FAusIMM). Mr.Naranjo Sierrais a consultant to the company and is therefore independent for the purposes of NI 43-101.About Santa AnaThe 100% owned Santa Ana project covers 27,000 hectares within the Mariquita District, through titles and applications, known as the largest and highest-grade primary silver district inColombiawith mining records dating back to 1585.Santa Ana's maiden resource estimate, detailed in the NI 43-101 Technical Report titled \"Santa Ana Property Mineral Resource Estimate,\" datedJune 8, 2023, prepared by AMC Mining Consultants, indicates an estimated indicated resource of 24.2 million ounces silver equivalent at a grade of 614 grams per tonne and an inferred resource of 13.5 million ounces at a grade of 435 grams per tonne. The identified resources span seven major vein systems that include multiple parallel veins and ore shoots: Santa Ana (San Antonio,Roberto Tovar,San Juanshoots); La Porfia (La Ivana); El Dorado (El Dorado, La Abeja shoots); Paraiso (Megapozo); Las Maras; Los Naranjos, and La Isabela.The drilling campaign aims to extend known mineralization and test new high-potential areas along the permitted section of the project's extensive 30 kilometres of mineralized trend. This year's exploration strategy aims to demonstrate a clear pathway to substantially expand the resource. These efforts underscore the scalability of Santa Ana and its potential for substantial resource growth, positioning the project to develop into a high-grade, economically viable, and environmentally responsible silver mine.About Outcrop SilverOutcrop Silver is a leading explorer and developer focused on advancing its flagship Santa Ana high-grade silver project inColombia. Leveraging a disciplined and seasoned team of professionals with decades of experience in the region. Outcrop Silver is dedicated to expanding current mineral resources through strategic exploration initiatives.At the core of our operations is a commitment to responsible mining practices and community engagement, underscoring our approach to sustainable development. Our expertise in navigating complex geological and market conditions enables us to consistently identify and capitalize on opportunities to enhance shareholder value. With a deep understanding of the Colombian mining landscape and a track record of successful exploration, Outcrop Silver is poised to transform the Santa Ana project into a significant silver producer, contributing positively to the local economy and setting new standards in the mining industry.ON BEHALF OF THE BOARD OF DIRECTORSNeither the TSX Venture Exchange nor its Regulation Services Provider (as such term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.Certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"potential,\" \"we believe,\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of Outcrop Silver to be materially different from those expressed or implied by such forward-looking statements or forward-looking information, including: the receipt of all necessary regulatory approvals, capital expenditures and other costs, financing and additional capital requirements, completion of due diligence, general economic, market and business conditions, new legislation, uncertainties resulting from potential delays or changes in plans, political uncertainties, and the state of the securities markets generally. Although management of Outcrop Silver have attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Outcrop Silver will not update any forward-looking statements or forward-looking information that are incorporated by reference."
    },
    {
        "title": "Xali Gold Announces Excellent Recoveries from KCA Drill Program at El Oro, Mexico",
        "date": "2025-02-12",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1666-tsx-venture/xgc/175116-xali-gold-announces-excellent-recoveries-from-kca-drill-program-at-el-oro-mexico.html",
        "content": "VANCOUVER, British Columbia, Feb. 12, 2025 (GLOBE NEWSWIRE) --Xali Gold Corp.(TSXV:XGC) (\"Xali Gold” or the ”Company”) is pleased to announce results from the 2024 drilling and metallurgical testing program completed by Kappes, Cassiday and Associates (“KCA”) on the Mexican Mine Tailings in El Oro (the “El Oro Tailings Project”) in Mexico. The drilling program was conducted to provide samples for metallurgical evaluation and testing of the tailings and to increase the level of confidence in the resource estimate completed by Xali Gold in 2014.“We are very pleased with the steady progress that KCA continues to make on the El Oro Tailings Project and their strong commitment to advancing the reprocessing project toward production,” states Joanne Freeze, President and CEO of Xali Gold. “The latest metallurgical testing has successfully optimized recovery processes, leading to even higher extraction rates than previously anticipated. Additionally, KCA has reported to the Company that the drilling program has not only added confidence in the 2014 resource estimate but has also shown possibility of resource expansion, further enhancing the project’s overall potential.”KCA contracted Major Drilling, a well-respected international drilling company, which utilized a state-of-the-art sonic drill rig – widely regarded as the best technology for drilling tailings. The program consisted of 34 holes which were drilled to the bottom of the tailings, reaching depths of up to 27 metres (“m”). Samples (approximately 75 mm in diameter) were collected on 1.5 m vertical intervals and sent to KCA labs in Reno, Nevada for processing. The assay results of the drilling program indicated the gold and silver content of the tailings was very uniform both laterally and vertically to depth and slightly higher than previously estimated by Xali Gold.KCA has reported to the Company that the drilling and metallurgical results indicate a potential 10 to 15% increase in the size of the resource as well as a small increase to both the gold and silver grades and recoveries. Given that KCA completed a much more thorough drilling and test work program than previous work, Xali Gold is very pleased to see an increased level of confidence in the previous work by Xali Gold.KCA estimates that the methods recommended above could give recoveries of up to 82% for gold and 86% for silver, however for economic calculations they will use 78% recovery for gold and 86% recovery for silver. These are slightly higher than the average overall recovery of 75% previously considered by KCA. Testing is still on-going to optimize reagent recovery and therefore costs.KCA has advised the Company that economic studies for the El Oro Tailings Project are underway but initial analyses indicate there is excellent potential for a profitable operation.Xali Gold entered into a Purchase Agreement with KCA after it was determined in 2014 that the gold and silver within the tailings were not easily recoverable using conventional metallurgical techniques. Recognized experts in complex recovery processes, KCA has since conducted extensive testing, demonstrating that higher gold and silver recoveries can be achieved by grinding the material to a fine size of 20 microns and then pre-treating it with chlorine to oxidize the sulfides and carbon.Additional UpdatesXali Gold has granted 750,000 restricted share units (“RSU”) to the Company’s Chief Financial Officer. The RSUs vest in stages: 20% on January 31, 2025, 40% on June 30, 2025, and 40% on December 31, 2025. Once vested, each RSU entitles the holder to acquire one common share of the Company. The RSUs were issued pursuant the terms of the Company's 2024 Omnibus Equity Incentive Plan.About Xali GoldXali Gold has gold and silver projects in Peru and Mexico. The Company’s flagship project, El Oro, is a district scale historic producer of gold and silver. While the Company’s main goal at El Oro is to make a new discovery, similar to the multi-million ounce (“oz”) gold and silver ore bodies mined historically, the Company has entered into two agreements to bring in cash flow. Two third parties now have entered Definitive Agreements with Xali Gold for the rights to produce gold and silver from the El Oro Project. Kappes, Cassiday & Associates (“KCA”) has the right to reprocess the Mexico Mine tailings which contain 1.27 million tonnes at a grade of 2.94 gpt gold and 75.12 gpt silver (3.85 gpt gold equivalent) containing 119,900 oz of gold and 3,061,200 oz of silver*. Remedioambiente S.A. de C.V. (“RM”) has the right to recover gold and silver from mineralized veins and backfill left behind in the historic mine workings on five concessions. The agreements provide for Xali Gold to receive funds from net smelter returns (“NSRs“) of up to 3% from each of these two agreements. In addition, the underground work by RM is expected to give the Company underground access for drilling the high-grade targets identified by previous drilling below the historic workings at El Oro and also assist in paying mineral rights fees.Future exploration in Mexico is planned to be focused on the El Oro property which covers 20 veins with past production and more than 57 veins in total, from which approximately 6.4M ozs of gold and 74M ozs of silver were reported to have been produced from just two of these veins (Ref. Mexico Geological Service Bulletin Nr. 37, Mining of the El Oro and Tlalpujahua Districts, by T. Flores in 1920). Modern understanding of epithermal vein systems indicates that several of the El Oro district’s veins hold excellent discovery potential, particularly below and adjacent to the historic workings of the San Rafael Vein, which was mined to an average depth of only 200m.With renewed interest in gold and silver exploration in South America, Xali Gold has recently been reviewing high sulphidation gold targets with features similar to the Yanacocha and Pierina mines, within proven high sulphidation epithermal belts in Peru. The Company also still maintains other properties in Peru.Xali Gold is dedicated to being a responsible community partner.Joanne C. Freeze, P.Geo., President and CEO is the Qualified Person as defined by National Instrument 43-101 for the projects discussed above. Ms. Freeze has reviewed and approved the contents of this release. Neither the TSX Venture Exchange nor its Regulation Services Provider accepts responsibility for the adequacy or accuracy of this release.On behalf of the Board of Xali Gold Corp.“Joanne Freeze” P.Geo.President, CEO and DirectorFor further information please contact:Joanne Freeze, President & CEOTel: + 1 604-512-3359This email address is being protected from spambots. You need JavaScript enabled to view it.Forward-looking InformationThis news release may contain forward-looking information (as such term is defined under Canadian securities laws) including but not limited to historical production records and resource estimates. While such forward-looking information is expressed by Xali Gold in good faith and believed by Xali Gold to have a reasonable basis, they may address future events and conditions and are therefore subject to inherent risks and uncertainties including those set out in Xali Gold’s MD&A. Factors that cause the actual results to differ materially from those in forward-looking information include, without limitation, gold prices, results of exploration and development activities, regulatory changes, defects in title, availability of materials and equipment, timeliness of government approvals, potential environmental issues, availability of capital and financing and general economic, market or business conditions. Xali Gold expressly disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except in accordance with applicable securities laws."
    },
    {
        "title": "Apollo Silver Outlines 2025 Calico Work Program and Progress at Cinco de Mayo",
        "date": "2025-02-12",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/2822-tsx-venture/apgo/175103-apollo-silver-outlines-2025-calico-work-program-and-progress-at-cinco-de-mayo.html",
        "content": "VANCOUVER, British Columbia, Feb. 12, 2025 (GLOBE NEWSWIRE) --Apollo Silver Corp. (“Apollo Silver” or the “Company”)(TSX.V:APGO, OTCQB:APGOF, Frankfurt:6ZF0) is pleased to provide details on the upcoming 2025 work program (the “2025 Program”) at its Calico Silver Project (“Calico” or the “Project”) located in San Bernardino County, California, as well as provide an update on the newly optioned Cinco de Mayo Project in Chihuahua, Mexico.Highlights:Commencement of barite work program to define and add this critical mineral to an updated mineral resource estimate for Waterloo;Initiating a mapping and sampling program in the Burcham mine area of Waterloo, following up on surface gold sampling results, in advance of a drill program to expand on gold mineralization outlined in the 2023 Waterloo Mineral Resource Estimate (“MRE”); andA new executive for the Ejido Benito Juarez, owner of the surface rights covering the Cinco de Mayo claims, was recently duly elected and certified.“Calico hosts approximately 170M ounces of silver with a significant amount of associated barite, a USGS listed critical mineral. With the United States’ growing focus on securing domestic critical mineral supplies, we believe the barite contained within the Calico Project can provide regulatory support. Accordingly, the upcoming program looks to produce a current and compliant barite resource at Calico, creating additional value for our shareholders,”commented Andrew Bowering, Chairman and Interim CEO.Bowering continued, “Furthermore, I am pleased with our progress to restore social license and gain access to our recently optioned Cinco de Mayo Project. As reported in this release, a new executive that is more favourable to resource development was recently certified for a three year term, opening up the opportunity for meaningful discussion for the first time in a dozen years.”Calico Technical ProgramThe 2025 Program will consist of two components: Expanding the 2023 Waterloo MRE by defining and potentially adding barite to the resource (the “Barite Program”); and mapping and sampling where the Barstow and Pickhandle formations are exposed at surface in the Burcham Mine area, following up on the recent gold surficial sampling results. Depending on the results of the 2025 Program, Apollo Silver plans to commence a small drill program aimed at better localizing and defining the extent of the gold mineralization (the “Burcham Program”).In 2022, barite was included on the US Geological Survey final list of critical minerals (the “USGS 2022 Report”) and given the abundant presence of high-quality barite associated with the Ag mineralization on the Waterloo property further geochemical analysis is warranted to better define and quantify the potential resource.The 2023 Waterloo MRE currently consists of 110 million ounces (“Moz”) silver (“Ag”) in 34.2 million tonnes (“Mt”) at 100 grams per tonne (“g/t”) Ag (Measured and Indicated categories); 0.72 Moz Ag in 0.3 Mt at 77 g/t Ag (Inferred category); and 70,000 oz gold (“Au”) in 4.5 Mt at an average grade of 0.5 g/t Au (see news release dated March 6, 2023).Barite ProgramThe proposed Barite Program includes a comprehensive re-assaying of selected historical and recent drill pulps by X-Ray Fluorescence, a method that will give a higher precision on the barium content, as its digestion is more complete than what was previously done at Waterloo (4-acid or aqua-regia). This will give a higher confidence level on the barium results that will be used for updating the Waterloo 2023 MRE with barite.The re-assay program is expected start in February 2025 and should take approximately 3 months to complete at the laboratory.Burcham ProgramThe proposed Burcham Program comprises a mapping and drill program which aims to better understand the extent of the gold mineralization at surface and within the Pickhandle Formation, focusing on determining the orientations of high-angle gold-bearing structures. Detailed surface mapping and rock sampling are expected to commence in late February 2025 and will take approximately one week to complete.Once the mapping is completed and interpreted to define drill targets, approximately 1,000 metres (“m”) of exploration core drilling is expected to eventually follow.About BariteBarite was identified in the USGS 2022 Report as essential to national security, the economy, renewable energy, and infrastructure. This list was produced under the mandate of the Energy Act of 2020 to highlight minerals vital to U.S. security and vulnerable to supply chain disruptions. The energy industry relies heavily on barite, with 90% used as a weighting agent in petroleum drilling. According to the USGS 2022 Report, the U.S. imports over 75% of its barite, with more than half sourced from China.Results from metallurgical test work completed (see May 2, 2023 news release) showed that barite concentrates of up to 94.6% were achieved. In addition, quality analysis confirmed that the barite concentrate produced meets or exceeds the American Petroleum Institute (“API”) quality requirements.Historical data from ASARCO's 1979 estimate at the Waterloo deposit reported 33.9 Mt of mineralized material at an average grade of 13.4% barite, totaling 4.5 Mt of barite at 93% grade.(1)Multi-element assays typically underreport barium, as such the 2025 Barite program will re-assay current and historical pulps using a method that ensures accurate barium concentration reporting. Upon completion, the Company plans to update the 2023 Waterloo MRE with barite.(1)The reader is cautioned not to treat this historical estimate or any part of it as a current mineral resource or reserve. An independent Qualified Person has not completed sufficient work to classify this as a current mineral resource or reserve and therefore the Company is not treating the historical estimate as a current mineral resource or mineral reserve.Gold Mineralization at CalicoThe Burcham area, home to the historic Burcham mine—the only gold-producing mine in the Calico district—operated in the 1940s. It featured two underground drifts that targeted gold-bearing, subvertical northwest structures (refer to figure 2). Au was associated with chalcopyrite, galena, sphalerite, and silver chloride, hosted in quartz, barite, and iron oxides.Total production figures are unknown, but historic public articles report grades of up to 0.31 ounces per ton (9.7 g/t). Historical work completed by both ASARCO and Pan American Silver confirmed the presence of Au mineralization at the contact between the Barstow and Pickhandle formations.Work completed by the Company in 2022 also showed the Au potential of the Burcham mine area, where surface sampling returned several high-grade results including 211 g/t Au and 849 g/t Ag (see February 14, 2023 news release). In addition, the 2023 drill program defined over a kilometer (“km”) of strike length of Au mineralization which remains open in all directions.The Company’s technical team believes that the contact between the Barstow and Pickhandle formations is an excellent exploration target for replacement style Au mineralization, and possible higher-grade vein hosted Au, and the upcoming 2025 mapping and drilling program will focus on this contact to better characterize the Au mineralization extent in the Burcham area.Figure 1: 2025 Barite Sampling ProgramFigure 2: 2025 Burcham Gold Exploration ProgramAbout the Calico ProjectThe Calico Project, located in San Bernardino County, California, includes the adjacent Waterloo and Langtry properties totaling 2,950 acres. Situated 15 km (9 miles) from Barstow and 5 km (3 miles) from commercial power, it features an extensive private gravel road network. The Project lies in the southern Calico Mountains of the Mojave Desert, part of the Basin and Range tectonic province, with the northwest-southeast trending range composed mainly of Tertiary volcanics, volcaniclastics, sedimentary rocks, and dacitic intrusions.Mineralization at Calico comprises high-level low-sulfidation silver-dominant epithermal vein-type, stockwork-type and disseminated-style associated with northwest-trending faults and fracture zones and mid-Tertiary (~19-17 Ma) volcanic activity.Calico represents a district-scale mineral system endowment with approximately 6,000 m (19,685 ft) in mineralized strike length controlled by the Company. Ag and Au mineralization are oxidized and hosted within the sedimentary Barstow formation and the upper volcaniclastic units of the Pickhandle formation along the contact between these units.The 2023 Waterloo MRE is 110 Moz Ag in 34.2 Mt at an average grade of 100 g/t Ag (Measured and Indicated categories); 0.72 Moz Ag in 0.3 Mt at an average grade of 77 g/t Ag (Inferred category); and 70,000 oz Au in 4.5 Mt at an average grade of 0.5 g/t Au. In addition, there is 50 Moz Ag and 19.3 Mt at an average grade of 81 g/t Ag (Inferred category) at Langtry.Cinco de Mayo UpdateOn February 3rd, 2025, a new and duly elected executive for the Ejido Benito Juarez, owner of the surface rights covering the Cinco de Mayo claims, was officially certified for a term of three years, having won an election on December 13, 2024, by a majority and an approximate margin of 2:1. As the new executive seems pro-development, there is now the opportunity to put an economic proposal to the general ejido population regarding the continued development of Cinco de Mayo, and investment in the local community, in keeping with the Company’s plan for the project.Qualified PersonThe scientific and technical data contained in this news release was reviewed and approved by Isabelle Lépine, M.Sc., P.Geo., Apollo Silver’s Director, Mineral Resources. Ms. Lépine is a registered professional geologist in British Columbia and a Qualified Person as defined by National Instrument 43-101 - Standards of Disclosure for Minerals Projects and is not an independent of the Company.About Apollo SilverApollo Silver has assembled an experienced and technically strong leadership team who have joined to advance world class precious metals projects in tier-one jurisdictions. The Company is focused on advancing its portfolio of two significant silver exploration and resource development projects, the Calico Project, in San Bernardino County, California and the Cinco de Mayo Project, in Chihuahua, Mexico.Please visitwww.apollosilver.comfor further information.ON BEHALF OF THE BOARD OF DIRECTORSAndrew BoweringChairman and Interim Chief Executive OfficerFor further information, please contact:Andrew BoweringChairman and Interim Chief Executive OfficerTelephone: +1 (604) 428-6128Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.Cautionary Statement Regarding “Forward-Looking” InformationThis news release includes “forward-looking statements” and “forward-looking information” within the meaning of Canadian securities legislation. All statements included in this news release, other than statements of historical fact, are forward-looking statements including, without limitation the timing and successful commencement and completion of the barite re-assay program and maiden barite resource estimate; the timing and successful completion of mapping and exploration drilling in the Burcham area; the Company’s ability to advance, develop and eventually permit the Project; future silver, gold and barite production; timing and plans of further exploration; and timing and success of any economic proposal or agreement with the Ejido Benito Juarez. Forward-looking statements include predictions, projections and forecasts and are often, but notalways,identifiedbytheuseofwordssuchas“anticipate”,“believe”,“plan”,“estimate”,“expect”,“potential”,“target”, “budget” and “intend” and statements that an event or result “may”, “will”, “should”, “could” or “might” occur or be achieved and other similar expressions and includes the negatives thereof.Forward-looking statements are based onthe reasonable assumptions,estimates, analysis, and opinions of the management of the Company made in light of its experience and its perception of trends, current conditions and expected developments, as well as other factors that management of the Company believes to be relevant and reasonable in the circumstances at the date that such statements are made.Forward-looking information is based on reasonable assumptions that have been made by the Company as at the date of such information and is subject to known and unknown risks, uncertainties and other factors that may have caused actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, includingbutnot limited to: risks associated with mineral exploration and development; metal and mineral prices; availability of capital; accuracy of the Company’s projections and estimates; realization of mineral resource estimates, interest and exchange rates; competition; stock price fluctuations; availability of drilling equipment and access; actual results of current exploration activities; government regulation; political or economic developments; environmental risks; insurance risks; capital expenditures; operating or technical difficulties in connection with development activities; personnel relations; and changes in Project parametersasplanscontinuetoberefined. Forward-looking statements are based on assumptions management believes to be reasonable, includingbutnotlimitedtothepriceofsilver,goldandBa;thedemandforsilver,goldandBa;theability tocarry on exploration and development activities; the timely receipt of any required approvals; the ability to obtain qualified personnel, equipment and services in a timely and cost-efficient manner; the ability to operate in a safe, efficient and effective matter; and the regulatory framework regarding environmental matters, and such other assumptions and factors as set out herein. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause resultsnottobeasanticipated,estimatedorintended.Therecanbenoassurancethatforward-lookingstatementswill prove to be accurate and actual results, and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward looking information contained herein, exceptinaccordancewithapplicablesecuritieslaws.Theforward-lookinginformationcontainedhereinispresentedfor thepurposeofassistinginvestorsinunderstandingtheCompany’sexpectedfinancialandoperationalperformanceand theCompany’splansandobjectivesandmaynotbeappropriateforotherpurposes.TheCompanydoesnotundertake to update any forward-looking information, except in accordance with applicable securities laws."
    }
]