[
    {
        "title": "First Majestic Silver anuncia Guía de Producción y Costos para 2025 y Detalles de la Llamada Conferencia",
        "date": "13 de Febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1082-tsx/ag/175195-first-majestic-announces-2025-production-and-cost-guidance-and-announces-conference-call-details.html",
        "content": "La empresa First Majestic Silver Corp. se complace en anunciar la Guía de Producción y Costos consolidados para el año 2025 de sus cuatro minas subterráneas en México: Cerro Los Gatos, Santa Elena, San Dimas y La Encantada. La adquisición de Gatos Silver, Inc. en enero de 2025 contribuirá al aumento en la producción de plata para este año. Se espera alcanzar entre 27.8 y 31.2 millones de onzas equivalentes de plata, incluyendo 13.6 a 15.3 millones de onzas de plata.\n\nEn cuanto a los costos, se proyecta que el Costo Total Todo Incluido (AISC) esté en un rango de $19.89 a $21.27 por onza de plata equivalente atribuible. La inversión capital en 2025 se estima en aproximadamente $182 millones, con $80 millones destinados a actividades de mantenimiento y $102 millones para proyectos de expansión.\n\nAdemás, se planea realizar aproximadamente 270,000 metros de perforación de exploración este año, una importante mejora comparada con los 182,932 metros completados en 2024. Las actividades de desarrollo subterráneo se centrarán en las minas de San Dimas, Santa Elena, Cerro Los Gatos y La Encantada.\n\nLa conferencia con la administración de First Majestic para discutir los resultados financieros de 2024 y la guía para 2025 se llevará a cabo el 20 de febrero de 2025. Para participar, se pueden utilizar los números de marcación proporcionados en el enlace adjunto en el artículo.\n\nFirst Majestic es una empresa minera pública dedicada a la producción de plata y oro en México y Estados Unidos. La compañía opera cuatro minas subterráneas en México y posee una variedad de activos en desarrollo y exploración. Para más información, visitar www.firstmajestic.com."
    },
    {
        "title": "Minaurum perfora interceptos de alto grado excepcionales en el Proyecto de Plata Alamos, incluyendo 3.00 m de 3,152 g/t de Plata",
        "date": "13 de Febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1380-tsx-venture/mgg/175218-minaurum-drills-exceptional-high-grade-intercepts-at-alamos-silver-project-including-3-00-m-of-3-152-g-t-silver.html",
        "content": "Minaurum Gold Inc. ha anunciado los últimos resultados de su programa de perforación en el Proyecto de Plata Alamos, ubicado en Sonora, México. El programa ha demostrado una robusta mineralización de plata, con interceptos excepcionales que incluyen 3.00 m de 4,173 g/t de plata equivalente (AgEq), 6.35 m de 380 g/t AgEq, y 5.75 m de 189 g/t AgEq. Estos resultados resaltan el potencial significativo del proyecto Alamos, mostrando una mineralización de plata consistente a lo largo de 1 km de la veta Promontorio. Darrell Rader, Presidente y CEO de Minaurum Gold, mencionó: 'Estos resultados subrayan la alta calidad del proyecto Alamos, destacando la mineralización continua de alta ley perforada en anchos impresionantes a lo largo de la zona de la veta Promontorio'.\n\nLa zona de la veta Promontorio, junto con la zona de la veta Europa, es uno de los objetivos prioritarios en el cual la compañía establecerá un recurso inicial en Alamos. La zona de la veta Promontorio, de 1 km de longitud, consiste en varias vetas, incluyendo Veta Grande, Veta del 100 y Veta Las Guijas. La perforación de Minaurum se enfoca en establecer espaciamientos de 75 a 100 m entre intersecciones de vetas, así como en perforaciones de expansión. Los resultados de los cuatro hoyos perforados en este comunicado demuestran la continuidad de alta ley de los hoyos de perforación anteriores.\n\nLa zona de Tirito será explorada con más hoyos durante el programa de perforación actual. Las muestras de perforación se envían a instalaciones de preparación independientes y los análisis son realizados por laboratorios de renombre. Para más información sobre los resultados y contactos, se puede acceder al comunicado original a través del siguiente enlace: [Minaurum Drills Exceptional High-Grade Intercepts at Alamos Silver Project](https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1380-tsx-venture/mgg/175218-minaurum-drills-exceptional-high-grade-intercepts-at-alamos-silver-project-including-3-00-m-of-3-152-g-t-silver.html)."
    },
    {
        "title": "Resultados del Trabajo de Compilación de 2024 de Sonoran Desert Copper en el Proyecto de Cobre Cuatro Hermanos",
        "date": "13 de Febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/2749-tsx-venture/sdcu/175213-sonoran-desert-copper-corporation-2024-compilation-work-results-on-the-cuatro-hermanos-copper-project.html",
        "content": "Sonoran Desert Copper Corporation (TSXV: SDCU) se complace en anunciar que ha completado la compilación de los conjuntos de datos geofísicos y ha correlacionado la base de datos de barrenos con las anomalías geofísicas de la data histórica de Polarización Inducida (IP) y Resistividad Eléctrica (ER) del Proyecto Cuatro Hermanos. El trabajo resume los análisis geofísicos de resistividad e IP, que consistieron en cuatro secciones, realizadas en el proyecto de cobre Cuatro Hermanos. La encuesta tuvo como objetivo delinear las anomalías de IP, con un enfoque en la mineralización de cobre y molibdeno. Los perfiles actualizados de resistividad e IP proporcionan una visualización mejorada, crucial para caracterizar las anomalías del depósito y respaldar futuras perforaciones de objetivos de cobre de alto perfil no probados dentro del área del proyecto. El trabajo de compilación geofísica fue realizado por el experimentado Fabrício Santos, MSc. en Geofísica.\n\n**Aspectos destacados:**\n- Identificación de zonas de corte profundo en las secciones de IP y Resistividad, actuando como posibles conductos para fluidos mineralizantes ricos en sulfuros como la fuente de la mineralización de cobre en el Proyecto Cuatro Hermanos.\n- La Línea Geoelectrical 1 muestra la continuidad de una posible zona de corte hacia el este.\n- Evidencia de mineralización asociada con sulfuros en anomalías de IP, indicando potencial para concentración de cobre en las estructuras de corte a profundidad.\n- Los barrenos cerca de las anomalías en la Zona Oeste indican que el cobre se gradúa hacia la dirección de estas estructuras, lo que sugiere que estos barrenos pueden estar próximos a estas zonas no probadas.\n\nEl Proyecto Cuatro Hermanos, ubicado en Sonora, México, comprende nueve concesiones que totalizan 2,825 hectáreas y contiene un gran sistema de pórfido de cobre-molibdeno con mediciones de superficie de al menos cuatro kilómetros este-oeste por dos kilómetros norte-sur. La Compañía lanzó un informe NI43-101 reciente sobre el Proyecto Cuatro Hermanos en octubre de 2023.\n\nLa mineralización primaria de sulfuros es calcopirita y molibdenita con oxido secundario de calcocita.\n\nEl Proyecto Cuatro Hermanos cuenta con 123 barrenos. 70 barrenos con análisis geoquímicos asociados para cobre y molibdeno fueron identificados. Por lo tanto, se crearon 70 registros de perforación con datos geoquímicos para estos dos elementos cuando estuvieron disponibles. Algunos barrenos tuvieron sus muestras compuestas.\n\nEl trabajo integrado sugiere que las futuras perforaciones deberían enfocarse en estas zonas de mayor potencial, con el objetivo de confirmar y delinear la extensión y ley de cobre y molibdeno a lo largo de estas estructuras."
    }
]