[
    {
        "title": "Silver Storm Mining anuncia un aumento del 107% en los Recursos Minerales Indicados en La Parrilla",
        "date": "11 de febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/433-tsx-venture/svrs/175028-silver-storm-announces-107-increase-in-indicated-mineral-resources-at-la-parrilla.html",
        "content": "La compañía minera Silver Storm Ltd. ha anunciado un incremento del 107% en los Recursos Minerales Indicados en su Complejo Minero de Plata La Parrilla, ubicado en Durango, México. Destacando un aumento del 107% en los Recursos Minerales Indicados y un aumento del 58% en los Recursos Minerales Inferidos, la actualización del estimado de Recursos Minerales fue realizada por David F. Machuca-Mory, PhD, PEng, de SRK Consulting (Canada) Inc. Entre los puntos destacados se encuentra que aproximadamente el 90% de los Recursos Minerales Indicados y el 85% de los Recursos Minerales Inferidos son de mineralización de sulfuro, mientras que el 10% de los Recursos Minerales Indicados y el 15% de los Recursos Minerales Inferidos son de mineralización de óxido. Además, se han modelado 23 estructuras mineralizadas adicionales, lo que demuestra un potencial alcista significativo.\n\nEl Presidente y CEO, Greg McKenzie, comentó que están muy satisfechos con esta actualización de recursos y que el crecimiento significativo mejora el potencial del proyecto, respaldando el objetivo de reiniciar la mina. Se completaron 18,626 metros de perforación subterránea, mostrando que las zonas previamente minadas continúan en profundidad y, en algunos casos, incluso muestran una mayor ley y espesor. Esta mejora en los Recursos Minerales realza el potencial del proyecto y respalda la meta de la compañía de reiniciar la mina y unirse al exclusivo grupo de productores de plata. Se espera que un informe técnico respalde este estimado de Recursos Minerales detallado en la Norma del Instrumento Nacional 43-101 y esté disponible en el sitio web de la compañía en los próximos 45 días a partir de la fecha de este comunicado."
    },
    {
        "title": "Silver Tiger Metals Intercepta 3.0 metros de 1,526.3 g/t Equivalente de Plata Dentro de 17.3 metros de 309.0 g/t Equivalente de Plata en la Zona de Sulfuro desde la Estación de Perforación Subterránea",
        "date": "11 de Febrero de 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1429-tsx-venture/slvr/175032-silver-tiger-intersects-3-0-meters-of-1-526-3-g-t-silver-equivalent-within-17-3-meters-of-309-0-g-t-silver-equivalent-in-the-sulfide-zone-from-underground-drilling-station.html",
        "content": "Silver Tiger Metals Inc. ha recibido los primeros resultados de ensayos del programa de perforación que se está llevando a cabo desde plataformas de perforación subterránea apuntando a las Zonas de Veta, Sulfuro y Pizarra de su Proyecto El Tigre de plata-oro al 100% de su propiedad, ubicado en Sonora, México. Entre los aspectos destacados del programa de perforación se encuentran los siguientes:El agujero ET-24-627: 3.0 metros con un promedio de 1,526.3 g/t de plata equivalente desde los 297.5 metros hasta los 300.5 metros, consistiendo en 833.5 g/t de plata, 0.13 g/t de oro, 0.87% de cobre, 6.22% de plomo y 13.24% de zinc dentro de 17.3 metros con un promedio de 309.0 g/t de plata equivalente desde los 297.5 metros hasta los 314.8 metros constituido por 160.0 g/t de plata, 0.12 g/t de oro, 0.18% de cobre, 1.34% de plomo y 2.68% de zinc en la Zona de Sulfuro.El agujero ET-23-626: 4.8 metros con un promedio de 321.0 g/t de plata equivalente desde los 253.5 metros hasta los 258.3 metros, consistiendo en 254.1 g/t de plata, 0.10 g/t de oro, 0.33% de cobre, 0.33% de plomo y 0.61% de zinc dentro de 17.1 metros con un promedio de 140.0 g/t de plata equivalente desde los 242.0 metros hasta los 259.1 metros constituido por 95.4 g/t de plata, 0.09 g/t de oro, 0.13% de cobre, 0.29% de plomo y 0.54% de zinc en la Zona de Sulfuro.Entre otros detalles, la Zona de Sulfuro, situado en contacto entre un granito del basamento y rocas volcánicas más jóvenes, muestra un alto potencial de mineralización con proporciones variables de zinc, hierro, plomo, cobre y sulfuros de plata. Este yacimiento alta ley es una parte crucial del estudio de prefactibilidad subterráneo y se extiende a lo largo de 750 metros, con espesores de 2 a 20 metros. Además, la Zona de Pizarra y las Vetasse presentan como zonas clave de interés con importantes potenciales de mineralización de plata, oro, cobre, plomo y zinc. Las perforaciones muestran resultados alentadores que contribuyen al crecimiento del Proyecto El Tigre como un complejo minero a largo plazo."
    },
    {
        "title": "IMPACT Silver intersecta 597 g/t de plata en 2.77m y 1,460 g/t de plata en 0.55m en el Descubrimiento Kena en la Mina Guadalupe",
        "date": "11 de Febrero del 2025",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/361-tsx-venture/ipt/175066-impact-silver-intersects-597-g-t-silver-over-2-77m-and-1-460-g-t-silver-over-0-55m-on-kena-discovery-at-guadalupe-mine.html",
        "content": "La empresa IMPACT Silver Corp. ha anunciado nuevos resultados de sus perforaciones en la veta Kena Sur en su mina productora de plata Guadalupe en el distrito de plata-oro Zacualpan, México. Los resultados muestran valores significativos de plata y otros metales preciosos, lo que indica un potencial prometedor en la zona.\n\nEntre los resultados obtenidos se destacan la perforación con 597 g/t de plata en 2.77 metros y 1,460 g/t de plata en 0.55 metros en la veta Kena Sur. Estos resultados confirman la extensión de la mineralización en la zona y sugieren oportunidades de explotación futuras.\n\nLa veta Kena Sur ha sido probada en una longitud de 150 metros desde el Nivel 140 de la mina y permanece abierta para extensión hacia el sureste, hacia arriba y hacia abajo. La empresa tiene previsto continuar con su programa de exploración en 2025 y se espera que actualice al mercado con resultados adicionales en los próximos meses.\n\nIMPACT Silver Corp. es una exitosa productora-exploradora con proyectos mineros en México. En el distrito Zacualpan, IMPACT posee el proyecto Zacualpan, donde varias minas de plata subterráneas y una mina a cielo abierto alimentan la planta de procesamiento Guadalupe. En la región de Plomosas, la empresa opera una mina de zinc-plomo-plata con un gran potencial de exploración.\n\nLos resultados de las perforaciones en la veta Kena Sur en Guadalupe reflejan el compromiso continuo de IMPACT con la exploración de alto grado de plata y otros metales valiosos en la región, mostrando un futuro prometedor para la compañía en el sector minero."
    }
]