[
    {
        "title": "Sierra Madre Gold and Silver Reports Record Monthly Production from the Guitarra Mine Complex",
        "date": "2025-02-10",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/3079-tsx-venture/sm/174945-sierra-madre-reports-record-monthly-production-from-the-guitarra-mine-complex.html",
        "content": "Vancouver, British Columbia--(Newsfile Corp. - February 10, 2025) -Sierra Madre Gold and Silver Ltd.(TSXV: SM) (OTCQX: SMDRF) (\"Sierra Madre\" or the \"Company\") is pleased to announce record production numbers for the month of January 2025; a record since restarting the 100% owned Guitarra Mine Complex located in Estado de Mexico, Mexico. The mine and processing plant continue to run at the current capacity of 500 wet metric tonnes per day; full commercial production at the Complex was achieved January 1, 2025. Weekly gold and silver concentrate deliveries continue.Operational numbers for January 2025:A total of 349.48 dry metric tonnes of concentrate were shipped in January with an additional 45.81 tonnes in inventory.Provisional weighted average silver grade of the concentrate shipments was 2,429 grams per tonne, gold averaged 32.124 grams per tonne.The Company looks forward to sharing detailed financial and production numbers moving forward on a steady quarterly basis. Year end financials are expected to be released in April 2025 and Quarter 1 2025 interim financials - reflecting Sierra Madre's first quarter of commercial production - are expected in May 2025.Qualified PersonMr. Gregory Smith, P. Geo, Director of Sierra Madre, is a Qualified Person as defined by NI 43-101, and has reviewed and approved the technical data and information contained in this news release. Mr. Smith has verified the technical and scientific data disclosed herein.About Sierra MadreSierra Madre Gold and Silver Ltd.(TSXV: SM) (OTCQX: SMDRF) is a precious metals development and exploration company focused on the Guitarra mine in the Temascaltepec mining district, Mexico, and the exploration and development of its Tepic property in Nayarit, Mexico. The Guitarra mine is a permitted underground mine, which includes a 500 t/d processing facility that operated until mid-2018 and restarted commercial production in January 2025.The +2,600 ha Tepic Project hosts low-sulphidation epithermal gold and silver mineralization with an existing historic resource.Sierra Madre's management team has played key roles in managing the exploration and development of more than 22Moz gold and 600Moz silver in combined mineral reserves and mineral resources. Sierra Madre's team of professionals has collectively raised over $1 billion for mining companies.On behalf of the board of directors of Sierra Madre Gold and Silver Ltd.,\"Alexander Langer\"Alexander LangerPresident, Chief Executive Officer and Director778-820-1189Contact:This email address is being protected from spambots. You need JavaScript enabled to view it.Cautionary Note Regarding Production DecisionsThe Company's decision to place the mine into commercial production, expand a mine, make other production related decisions, or otherwise carry out mining and processing operations, is largely based on internal non-public Company data and reports from previous operations and the results of test mining and processing. The Company is not basing any production decisions on NI 43-101 compliant reserve estimates, preliminary economic assessments or feasibility studies and, as a result, there is greater risk and uncertainty as to future economic results from the Guitarra Mine Complex, including increased uncertainty of achieving any particular level of recovery of minerals or the cost of such recovery, including increased risks associated with developing a commercially mineable deposit, and a higher technical risk of failure than would be the case if a feasibility study were completed and relied upon to make a production decision.Cautionary Note Regarding Forward-Looking InformationNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.This press release contains \"forward-looking information\" and \"forward-looking statements\" within the meaning of applicable securities legislation. The forward-looking statements herein are made as of the date of this press release only, and the Company does not assume any obligation to update or revise them to reflect new information, estimates or opinions, future events or results or otherwise, except as required by applicable law. Often, but not always, forward-looking statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budgets\", \"scheduled\", \"estimates\", \"forecasts\", \"predicts\", \"projects\", \"intends\", \"targets\", \"aims\", \"anticipates\" or \"believes\" or variations (including negative variations) of such words and phrases or may be identified by statements to the effect that certain actions \"may\", \"could\", \"should\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Forward-looking statements include, without limitation, statements regarding discussions of future plans, including the expected timing of concentrate shipments; the Company increasing production; the Company receiving revenues on a weekly basis and such revenues allowing the Company to comfortably expand to without further capital needs; production and the expected timing and production levels thereof.The forward-looking statements involve numerous risks and uncertainties, and actual results might differ materially from results suggested in any forward-looking statements. These risks and uncertainties include, among other things, that predicted production levels will be achieved and that existing production levels will be maintained.In making the forward-looking statements in this news release, the Company has applied certain material assumptions, including without limitation, that the Company will be able to execute its future plans as intended, that predicted production levels will be achieved and that existing production levels will be maintained.Although management of the Company has attempted identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes."
    },
    {
        "title": "Endeavour Silver Provides Q4 2024 Construction Progress Update on Terronera; Surface Construction Progress Nearly 90% Complete",
        "date": "2025-02-07",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1070-tsx/edr/174891-endeavour-silver-provides-a-q4-2024-construction-progress-update-on-terronera-surface-construction-progress-nearly-90-complete.html",
        "content": "VANCOUVER, British Columbia, Feb. 07, 2025 (GLOBE NEWSWIRE) --Endeavour Silver Corp.(\"Endeavour\" or the \"Company\")(NYSE: EXK; TSX: EDR)provides a Q4 2024 construction progress update for its Terronera Project in Jalisco state, Mexico. A photo gallery presentation accompanies this news release and can be foundhereor on the Company website atTerronera Project Progress Photos. All dollar ($) references in this news release are in United States dollars.Substantial progress was achieved on Terronera’s Upper Plant Platform during the fourth quarter with systems commissioning underway. Focus continues on the Lower Platform.“Endeavour Silver’s Terronera Project is nearing completion,” commented Don Gray, Chief Operating Officer. “Dry commissioning is advancing well on the Upper Platform and we’re completing final installations and the last of the punch list items. Our team’s efforts are concentrated on timely completion of the Lower Platform where structural steel is advancing to install the tailing filters. We’re focused on maintaining our construction schedule and momentum to have Terronera ready for full commissioning in early Q2 2025.”Q4 2024 Construction and Development HighlightsSite works and activities as of December 31, 2024:Safety – The Health and Safety Program and Procedures are complete and ready for transition from construction and commissioning into operations.Community Relations – Community support and the hiring and training of local employees continues to be a priority.Progress – Overall project progress reached 89.4% completion. Current capital expenditures are approximately $302 million as of December 31, 2024. Management estimates total project spend of $332 million.Mine Development – During the fourth quarter, 1,694 metres were developed underground for a project total of 7,239 metres. Of note, the underground explosives magazine storage permit was approved, which will improve development efficiencies.Upper Plant Platform Site – Much of the construction is complete with final punch list items being addressed and various areas being handed over to the commissioning and operations teams.Primary Crusher – The Primary Jaw Crusher commissioning was completed, and the area was transferred to operations. A total of 6,000 tonnes of ore has been crushed.Grinding – Commissioning of the grinding circuit commenced with successful SAG and ball mill testing for multiple hours at full operating speed to check bearing temperatures, vibrations and lubrication systems under no-load conditions.Flotation – Flotation equipment, including pumps, tanks, verti-mill, low pressure blowers and instrumentation have been installed. Remaining items for installation include pressure relief valves, hoses, and final piping.Raw and Process Water Tanks – Installation and hydro-testing are 100% complete.Lower Platform Facilities and Tailing Storage Facility (TSF) – Lower Platform area was 42% complete.TSF Main Embankment – The main embankment reached the 1,185-metres elevation and the TSF facility is ready to receive filtered tailing.Tailing Filters – Swing plates mounted below both tailing filters were installed, and first floor concrete was poured; structural steel installation is advancing for the second floor prior to installing the filter press.Tailing Area Tanks – Storage tanks have been assembled; hydro testing and anchoring will be completed in Q1 2025.Event Pond Liner – The pond area liner was installed; the feed and overflow channel lining will be completed in Q1 2025 (completed in January).Upper surface water diversion canal – The TSF diversion canal for the south and east perimeters is nearly 90% complete.Concentrate Filter Building – Second concrete floor was poured and is ready for installing the concentrate filter.Auxiliary BuildingsLaboratory Building – Construction was completed, and the facility was turned over to operations.Plant Maintenance Building – Reached 80% completion and is scheduled for completion mid-Q1 2025.Onsite Personnel – At the end of Q4, the Terronera workforce included 297 Endeavour Silver employees and 821 contract workers.Updated Initial Capital CostThe project team conducted a comprehensive review of the remaining Terronera completion costs. The Company forecasts initial capital costs to be $332 million (see table below). The mining cost increase of approximately $16 million is related to the extended project schedule as well as increased waste rock disposal costs, including hauling, placement at the temporary waste dump and construction of the permanent waste rock dump. Mineral process plant costs, which includes the lower platform and tailing facility construction, are estimated to be approximately $13 million over budget. These costs include additional work for expediting structural steel fabrication, blasting required for lower platform excavation, offsite materials purchased for tailing facility construction, extra work required for supporting the cut above the lower platform elevation and contractor indirect costs. The $2.2 million increase for site infrastructure is related to the additional scope for constructing the mill shop, warehouse and assay/met lab and temporary power generation. Total project indirect costs increased by $29 million, offset with the $8.7 million contingency. Owner costs increased due to additional engineering, construction management, enlarging the camp capacity and adding several administrative support buildings (e.g., offices and training). Project indirect costs increased due to the extended project schedule and a larger workforce, overlapping project construction and completion activities.(millions)2024 Revised ScenarioInitial Capex2025 Updated ScenarioInitial CapexVarianceMining$83.80$100.20$16.40Mineral Processing Plant$64.80$78.00$13.20Site Infrastructure$56.20$58.40$2.20Total Direct Costs$204.80$236.60$31.80Owner Costs$33.30$50.30$17.00Project Indirect Costs$24.20$45.10$20.90Contingency$8.70-($8.70)Total Indirect Costs$66.20$95.40$29.20Total (Direct & Indirect)$271.00$332.00$61.00Next Steps and PlanningThe Terronera Project is anticipated to begin full system commissioning in early Q2 2025.For Q1 2025, Upper Platform efforts will focus on installing remaining items, punch list completion, and commissioning. The TSF Main Embankment is anticipated to reach the final 1,198-metre elevation and tailing and concentrate filters will be installed, along with final piping, electrical and instrumentation work. The remaining critical path items are the tailing filter presses, which are expected to be completed by early Q2 2025. The Company plans to provide operational guidance as construction approaches wet commissioning.Visitwww.terronera.com, our dedicated project website, to stay informed on the ongoing development at Terronera. Explore updates, learn about our commitment to environmental stewardship, and discover the positive impacts on local communities.About Endeavour Silver:Endeavour is a mid-tier precious metals company committed to sustainable and responsible mining practices. With operations in Mexico and the development of the new cornerstone mine in Jalisco State, the Company aims to contribute positively to the mining industry and the communities in which it operates. In addition, Endeavour has a portfolio of exploration projects in Mexico, Chile, and the United States, which has helped it achieve its goal of becoming a premier senior silver producer.Contact InformationAllison Pettit, Director of Investor RelationsTel: (604) 640 4804Email:This email address is being protected from spambots. You need JavaScript enabled to view it.Website:www.edrsilver.comCautionary Note Regarding Forward-Looking StatementsThis news release contains \"forward-looking statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and \"forward-looking information\" within applicable Canadian securities legislation. Such forward-looking statements and information herein include but are not limited to statements regarding the development of the Terronera Project, the anticipated timing of construction steps and commencement of full commissioning at the Terronera Project, the Terronera Project's forecasted operations, costs and expenditures, Endeavour’s future operational guidance announcements, and the timing and results of various related activities. The Company does not intend to and does not assume any obligation to update forward-looking statements or information other than as required by applicable law.Forward-looking statements or information involve known and unknown risks, uncertainties, and other factors that may cause Endeavor's actual results, level of activity, production levels, performance, or achievements, and its operations to be materially different from those expressed or implied by such statements. Such factors include but are not limited changes in production and costs guidance; the ongoing effects of inflation and supply chain issues on mine economics; national and local governments, legislation, taxation, controls, regulations and political or economic developments in Canada, Chile, the USA and Mexico; financial risks due to precious metals prices; operating or technical difficulties in mineral exploration, development and mining activities; risks and hazards of mineral exploration, development and mining; the speculative nature of mineral exploration and development; risks in obtaining necessary licenses and permits; continued compliance with the project loan debt facility; the ongoing effects of inflation and supply chain issues on the Terronera Project economics; fluctuations in the prices of silver and gold, fluctuations in the currency markets (particularly the Mexican peso, Chilean peso, Canadian dollar and US dollar); and challenges to the Company's title to properties; as well as those factors described in the section \"risk factors\" contained in the Company's most recent form 40F/Annual Information Form filed with the SEC and Canadian securities regulatory authorities.Forward-looking statements are based on assumptions management believes to be reasonable, including but not limited to the continued operation of the Company's mining operations, no material adverse change in the market price of commodities forecasted Terronera mine economics as of 2024, mining operations will operate, and the mining products will be completed under management's expectations and achieve their stated production outcomes, and such other assumptions and factors as set out herein. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or information, other factors may cause results to be materially different from those anticipated, described, estimated, assessed, or intended. There can be no assurance that any forward-looking statements or information will be accurate, as actual results and future events could differ materially from those anticipated in such statements or information. Accordingly, readers should not place undue reliance on forward-looking statements or information."
    },
    {
        "title": "SilverCrest Metals Securityholders Approve Transaction with Coeur Mining",
        "date": "2025-02-06",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1776-tsx/sil/174873-silvercrest-securityholders-approve-transaction-with-coeur-mining.html",
        "content": "VANCOUVER, BC,Feb. 6, 2025/CNW/ -SilverCrest Metals Inc.(\"SilverCrest\" or the \"Company\") announces that the Company's securityholders have approved the plan of arrangement (the \"Arrangement\") with Coeur Mining, Inc. (\"Coeur\"), whereby Coeur will indirectly, among other things, acquire all of the issued and outstanding SilverCrest shares. The vote was passed at SilverCrest's special meeting of securityholders (the \"Meeting\") held earlier today.The Arrangement was approved by (i) 99.32% of the votes cast by shareholders present in person or represented by proxy and entitled to vote at the Meeting, (ii) 99.34% of the votes cast by shareholders and optionholders, voting together as a single class, present in person or represented by proxy and entitled to vote at the Meeting, and (iii) 99.31% of the votes cast by shareholders present in person or represented by proxy and entitled to vote at the Meeting, excluding the votes cast by such shareholders that were required to be excluded pursuant to Multilateral Instrument 61-101 –Protection of Minority Security Holders in Special Transactions. The report of voting results will be available under the Company's profile on SEDAR+ atwww.sedarplus.caand on EDGAR atwww.sec.gov.The closing of the transaction is expected to occur on or aboutFebruary 14, 2025subject to the satisfaction or waiver of the remaining customary closing conditions, including receipt of the approval of the Supreme Court ofBritish Columbia.ABOUT SILVERCREST METALS INC.SilverCrest is a Canadian precious metals producer headquartered inVancouver, BC.  The Company's principal focus is its Las Chispas Operation inSonora, Mexico. SilverCrest has an ongoing initiative to increase its asset base by expanding current resources and reserves, acquiring, discovering, and developing high value precious metals projects and ultimately operating multiple silver-gold mines in the Americas.  The Company is led by a proven management team in all aspects of the precious metal mining sector, including taking projects through discovery, finance, on time and on budget construction, and production.Forward-Looking StatementsThis news release contains\"forward-looking statements\" and \"forward-looking information\" (collectively \"forward-looking statements\") within the meaning of applicable Canadian andUnited Statessecurities legislation. The words \"potential\", \"expected\" and similar expressions or other words of similar meaning, and the negatives thereof, are intended to identify forward-looking statements. These include, without limitation, statements with respect to: SilverCrest and the combined company's plans and expectations with respect to the proposed Arrangement and the anticipated impact of the proposed Arrangement on the combined company's results of operations, financial position, growth opportunities and competitive position, the receipt of required approvals, and the expected timing of completion of the Arrangement.These forward-looking statements involve significant risks and uncertainties that could cause actual results to differ materially from those anticipated, including, but not limited to, the risk that any other condition to closing of the Arrangement may not be satisfied; the risk that the closing of the Arrangement might be delayed or not occur at all; the risk that the either Coeur or SilverCrest may terminate the Arrangement Agreement and either Coeur or SilverCrest is required to pay a termination fee to the other party; potential adverse reactions or changes to business or employee relationships of Coeur or SilverCrest, including those resulting from the announcement or completion of the Arrangement; the diversion of management time on transaction-related issues; the ultimate timing, outcome and results of integrating the operations of Coeur and SilverCrest; the effects of the business combination of Coeur and SilverCrest, including the combined company's future financial condition, results of operations, strategy and plans; the ability of the combined company to realize anticipated synergies in the timeframe expected or at all; changes in capital markets and the ability of the combined company to finance operations in the manner expected; the risk that Coeur or SilverCrest may not receive the required stock exchange and regulatory approvals of the Arrangement; the expected listing of consideration shares on the NYSE; the risk of any litigation relating to the proposed Arrangement; the risk of changes in governmental regulations or enforcement practices; the effects of commodity prices, life of mine estimates; the timing and amount of estimated future production; the risks of mining activities; and the fact that operating costs and business disruption may be greater than expected following the public announcement or consummation of the Arrangement. Expectations regarding business outlook, including changes in revenue, pricing, capital expenditures, cash flow generation, strategies for the combined company's operations, gold and silver market conditions, legal, economic and regulatory conditions, and environmental matters are only forecasts regarding these matters.Additional factors that could cause results to differ materially from those described above can be found in SilverCrest's management information circular in connection with the Meeting and SilverCrest's annual information form for the year endedDecember 31, 2023, which are filed with the SEC and on SEDAR+ and available from SilverCrest's website atwww.silvercrestmetals.comunder the \"Investors\" tab, and in other documents SilverCrest files with the SEC or on SEDAR+. All forward-looking statements speak only as of the date they are made and are based on information available at that time. SilverCrest does not assume any obligation to update forward-looking statements to reflect circumstances or events that occur after the date the forward-looking statements were made or to reflect the occurrence of unanticipated events except as required by applicable securities laws. As forward-looking statements involve significant risks and uncertainties, caution should be exercised against placing undue reliance on such statements."
    },
    {
        "title": "Southern Silver Exploration Options Nazas Property, Mexico",
        "date": "2025-02-06",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/441-tsx-venture/ssv/174870-southern-silver-options-nazas-property-mexico.html",
        "content": "Vancouver, British Columbia--(Newsfile Corp. - February 6, 2025) -Southern Silver Exploration Corp.(TSXV: SSV) (the \"Company\" or \"Southern Silver\") is pleased to announce that it has entered into a letter agreement with La Cuesta International, S.A. de C.V. to acquire the Nazas exploration project in Durango, Mexico.The letter agreement provides Southern Silver the option to earn a 100% interest in the Nazas project by (i) making pre-production cash payments totalling US$130,000 over a 36 month period with a pre-production payment of US$25,000 payable every 6 months thereafter; and (ii) completing a minimum aggregate 8,000 metres of drilling on the project over a 4 year period. The Company will also pay US$25,000 in reimbursement of concession rights taxes. The project is subject to net smelter return royalty in the amount of 2% of net smelter returns on the current claims, 1% net smelter returns on any new claims acquired within an area of influence, and 0.5% of net smelter returns on any third party owned lands acquired within the area of influence. The net smelter return royalty will be reduced by half upon cumulative pre-production payments and net smelter return royalty payments totalling US$10 million.The Nazas Ag-Au-Pb-Zn property comprises 5 claims totaling 2,189 ha and is located on the eastern flank of the Sierra Madre Occidental Mountain range in north-central Durango State, Mexico. The Nazas property is accessible by road from the City of Durango, located approximately 160km to the south.The property sits within the heart of Mexico's Faja de Plata (Belt of Silver) and is located just 15km to the east of Endeavor Silver's Pitarilla Deposit, one of the largest unexploited silver resources in Mexico. The property features similar host stratigraphy and mineralizing systems to Pitarilla with a high potential to host significant epithermal vein, porphyry and replacement-styled mineral deposits.Figure 1: Location of Southern Silver's Nazas and Cerro Las Minitas projects, Durango MexicoModern exploration of the Nazas project started in the mid-1990s by the vendor which staked it and adjacent ground, including the Pitarilla Property, on behalf of Silver Standard Resources Inc (now SSR Mining Inc.). SSR Mining sold the Pitarilla Project to Endeavor Silver Corp. in January 2022 and ceased exploration operations in Mexico returning the Nazas property to the vendors.The property was extensively explored from the early 2000's through to the mid-2010's resulting in a comprehensive database that includes:Property wide geological mappingSeveral thousand rock and soil samples collectedChannel samplingProperty wide clay alteration studiesMagnetic, IP, Gravimetric and Magneto-telluric geophysical surveys over select target areas; andResults from 18 drill holes totaling 4,070 metres (12 RC and 6 DDH)Seven different targets are identified on the property which will be the focus of future exploration on the property.Multiple epithermal vein occurrences occur throughout the property and are characterized by fine quartz stockworks localized along cross-cutting NW-SE and NE-SW-trending structures often enveloped within broad gold-enriched haloes, up to 60 metres wide, of oxidized hematite-goethite-bearing rock. Drilling by Silver Standard at the Yerbabuena and Santa Rita targets returned strongly anomalous Au-Ag mineralization (+0.1g/t Au and +1g/t Ag) over 10s of metres in multiple drill holes. Mineralization remains open both laterally and at depth for further testing.Note that the reported mineralization is from historic records and has not been independently validated by the author.Deeper stratigraphy and associated base-metal-enriched mineralization is exposed at the Yescas prospect reflecting the potential for both porphyry and replacement styled mineralization. Three quartz-feldspar intrusive phases have been identified on the property and are similar to those associated with the Pitarilla deposit.Upcoming work on the Nazas project will focus on validation of the historic surface and drill data and further compilation and interpretation of what is a substantive database toward establishing drill targets for testing in Q3 2025.Consulting Agreement with La Cuesta International, Inc.Southern Silver has agreed to enter into a consulting agreement with La Cuesta International, Inc. pursuant to which La Cuesta International, Inc. will provide technical advisory services with respect to the Nazas project as well as the Company's other Mexican projects. Southern Silver will issue 100,000 common shares in the capital of the Company in consideration of such services. The consulting agreement is subject to TSX Venture Exchange acceptance.About Southern Silver Exploration Corp.Southern Silver Exploration Corp. is an exploration and development company with a focus on the discovery of world-class mineral deposits either directly or through joint-venture relationships in mineral properties in major jurisdictions. Our specific emphasis is the 100% owned Cerro Las Minitas silver-lead-zinc project located in the heart of Mexico's Faja de Plata, which hosts multiple world-class mineral deposits such as Penasquito, Los Gatos, San Martin, Naica and Pitarrilla. We have assembled a team of highly experienced technical, operational and transactional professionals to support our exploration efforts in developing the Cerro Las Minitas project into a premier, high-grade, silver-lead-zinc mine. Located in the same State as the Cerro Las Minitas property is the newly acquired Nazas property. Our property portfolio also includes the Oro porphyry copper-gold project and the Hermanas gold-silver vein project where permitting applications for the conduct of a drill program is underway, both located in southern New Mexico, USA.Robert Macdonald, MSc. P.Geo, is a Qualified Person as defined by National Instrument 43-101 and supervised directly the collection of the data from the Nazas project that is reported in this disclosure and is responsible for the presentation of the technical information in this disclosure.On behalf of the Board of Directors\"Lawrence Page\"Lawrence Page, K.C.President & Director, Southern Silver Exploration Corp.For further information, please visit Southern Silver's website atsouthernsilverexploration.comor contact us at 604.641.2759 or by email atThis email address is being protected from spambots. You need JavaScript enabled to view it..Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.This news release contains forward-looking statements. Forward-looking statements address future events and conditions and therefore involve inherent risks and uncertainties. Actual results may differ materially from those currently anticipated in such statements. Forward-looking statements in this news release include plans to acquire the Nazas property, and TSX Venture Exchange approval of the consulting agreement with La Cuesta International, Inc. These statements are based on a number of assumptions, including, but not limited to, general economic conditions, interest rates, commodity markets, regulatory and governmental approvals for the Company's projects, and the availability of financing for the Company's development projects on reasonable terms. Factors that could cause actual results to differ materially from those in forward looking statements include the timing and receipt of government and regulatory approvals, and continued availability of capital and financing and general economic, market or business conditions."
    },
    {
        "title": "Riverside Resources and Fortuna Mining Progress with Phase 2 Exploration Program After Positive Drill Results from Q4 2024 Cecilia Drill Program Sonora, Mexico",
        "date": "2025-02-05",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/866-tsx-venture/rri/174762-riverside-resources-and-fortuna-mining-progress-with-phase-2-exploration-program-after-positive-drill-results-from-q4-2024-cecilia-drill-program-sonora-mexico.html",
        "content": "Vancouver, British Columbia--(Newsfile Corp. - February 5, 2025) -Riverside Resources Inc.(TSXV: RRI) (OTCQB: RVSDF) (FSE: 5YY) (\"Riverside\" or the \"Company\"),is pleased to announce that the next stage of exploration is now progressing, following the successful completion of the joint Q4 2024 drilling program at the Cecilia Gold Project in Sonora, Mexico.The drill program was conducted in partnership with Fortuna Mining, which continues to advance their earn-in option on the project (See news release: March 13, 2024). Riverside, acting as the operator, completed an initial five-hole, 2,250-meter drilling campaign designed to test four distinct target areas generally with one geological evaluation drill hole per target to seek scale and evidence of a potentially strong hydrothermal system which would set up for a follow up 2025 exploration program which has now begun. The drilling in Q4 hit favorable indicators as outlined below and continued to develop the district scale targets both at Cerro Magallanes and on the broader >60 km sq property package with vast areas to expand.The drill program announced in September (See press release: September 10, 2024), where Riverside outlined its goals to define and expand key targets at Cecilia. The latest program hit gold mineralization in each target area and broader epithermal alteration consistent with target styles like the nearby Mercedes Mine Sonora and Oatman Gold District Arizona. At Magallanes Hill, two holes were drilled at the San Jose target, followed by one hole on the eastern flank, referred to as the East Target. Additionally, two holes were drilled in the Mesa area to the south: one testing the Mayra Vein concept and the final hole drilled eastward to intersect the Mesa Fault, a significant structural target.\"We are encouraged by the results of the Q4 2024 drilling program, which focused on testing geological features with limited previous drilling, just one or two holes in each area, and yielded positive indicators while also uncovering some unexpected geologic surprises,\" said John-Mark Staude, President and CEO of Riverside Resources. \"This program not only confirmed earlier gold intercepts but also expanded the scale of exploration with significant step-outs and new target areas. The ongoing work underscores our commitment to unlocking new opportunities and delivering sustained value to our stakeholders.\"Highlights of the Drill Program:San Jose Vein System (North Breccia): Two holes were drilled to extend testing of this structure, building upon results from previous drilling and assay work. The San Jose system has shown significant mineralization potential, as highlighted in prior programs including samples returning values of up to48.3 g/t Au over 0.75 mat surface (See press release: January 28, 2021). Drilling to depths of 500 to 800 meters successfully intersected the San Jose structure in both holes, confirming the continuity of this extensive vein system. Notably, hole CED24-010 returned an intercept of3.41 g/t Au over 4 meters, starting at a depth of 76 meters, with an additional lower intercept including0.39 g/t Au over 5.25mstarting at 319m identified along the projected extension of the San Jose vein which topographically is over 500m below the Magallanes peak and previous drill intercepts in the upper part of the San Jose vein system. These results are illustrated in the cross-section below.East Target: A single hole was drilled perpendicular to known mineralization identified in surface samples and previous drilling by Cambior (1996). This hole crossed through thick zones of alteration, adding valuable geological data for this target and confirming that Cecilia has strong feeder zones for gold. The hole intersected at least 6 gold bearing intervals with one being0.38 g/t Au over 1.75mstarting from 149.25m. This hole was drilled eastward in order to constrain the dip as past drill holes had been drilled westward. The single new hole intercepted multiple veins for this part of the eastern Magallanes system as shown on the map below and on the Company websiteMesa Ranch Area (Mayra Vein): The 2024 program was the first time the Mayra Vein has been tested with this the first drill to be conducted on the broader Cecilia project, which encompasses over a dozen identified targets. This hole was intended to test the northwest trending epithermal veins related with felsic dikes that potentially feed toward and likely cut the Puma Dome. These district-scale targets from the Mesa Ranch area have potential along strike for further exploration. Core drill hole CED24-011 intersected multiple vein zones, including an interval of 0.21 g/t Au over 2 meters starting at 281 meters. The gold-bearing interval featured quartz veining and oxides whose projection aligns with surface-sampled veins that extend over 700 meters along strike, further highlighting the potential and continued interest in these vein systems.South Mesa Fault Zone (Mesa South): The final hole of the program focused on the extensive South Mesa Fault; a 10 km-long structure comparable to fault-controlled gold systems like those in Nevada's Midas District. Drill hole CED24-012 intersected the fault at 110m and comprises a 5m thick interval of sheared brecciated rock which can be projected to surface and followed along strike. Surface samples returned gold values of over 2 g/t gold along the surface projection of this fault. Plans are in place for additional exploration of the Mesa South region for the first half of 2025, which will include tracking the Mesa fault's continuity along strike.The table below summarizes the locations and depths for the five holes completed in this first drilling round with Fortuna Mining.The drilling location map below shows the 5 holes (3 drill pads) which correlate with the drill hole descriptive table above. Drill hole CED24-008 at Magallanes was deeper than any previous drilling. Figure 1 shows the drill traces as they intersected the down dip projection of the veins.Figure 1- Geology map and location of the five 2024 drill holes shown in red. The straight and thin black lines near Magallanes are drill holes from previous campaigns. This new program stepped out to test the East Target (CED24-009) and the Mayras and South Mesa with single holes.The cross-section figure below highlights hole CED24-010 from the drill program, which demonstrates the intersections of multiple vein structures. These structures are now interpreted to potentially extend over 800 meters vertically, suggesting they could be part of a significant epithermal system. Further exploration is planned for 2025, including an MT (Magneto-telluric) geophysical survey to refine our targeting of the system. Based on the results of these surveys, additional drilling may be undertaken to further evaluate the system's potential. The Project includes numerous untested targets throughout the 60 km sq land package.Figure 2:Cross section of the Magallanes Dome showing the volcanic units and structuresThis drill program advanced the understanding of the Cecilia system's geology, confirming significant low-sulfidation epithermal features in the Cerro Magallanes area. Data from the drilling suggests the mineralization system is tilted southeast, supported by surface mapping, geochemical analysis, and structural modeling.The Cecilia Gold Project continues to demonstrate significant potential. Fortuna Mining's technical expertise and funding have enabled systematic exploration, with the partnership potentially targeting a larger follow-up program in 2025. The drilling positively demonstrated scale and alterations consistent with a mineralized system worthy of more advanced drilling in addition to continued target testing.Stock Option Grant:On February 4th, 2025, the Company granted 1,450,000 incentive stock options (the \"Options\") to certain Directors, Officers and Consultants of the Company. The Options are exercisable at $0.13 per share for a period of 5 years from the date of grant. Options granted to individuals in their capacity as a director vest in 3 equal instalments over 18 months. Options granted to Officers and Consultants vest in 4 equal instalments over 12 months. The Options were granted pursuant to the Company's shareholder approved stock option plan and are subject to the policies of the TSX Venture Exchange and any applicable regulatory hold periods.Qualified Person & QA/QC:The scientific and technical data contained in this news release pertaining to the Cecilia Project was reviewed and approved by Freeman Smith, P.Geo, a non-independent qualified person to Riverside Resources who is responsible for ensuring that the information provided in this news release is accurate and who acts as a \"qualified person\" under National Instrument 43-101 Standards of Disclosure for Mineral Projects.Drill core samples were sealed with zip straps and picked up by Bureau Veritas at site who took custody and drove samples to the Bureau Veritas Laboratories in Hermosillo, Mexico for fire assaying for gold. The rejects remained with Bureau Veritas in Mexico while the pulps were transported to Bureau Veritas' laboratory under their custody to Vancouver, BC, Canada and analyzed for 45 elements using their ICP/ES-MS analysis. A QA/QC program was implemented as part of the sampling procedures for the exploration program. Standards, duplicates and blanks were inserted into the sample stream prior to being sent to the laboratory. The QA/QC analysis was completed with results fitting well with standards, blanks and duplicates not varying beyond normal statistical variance.About Riverside Resources Inc.:Riverside is a well-funded exploration company driven by value generation and discovery. The Company has over $4M in cash, no debt and less than 75M shares outstanding with a strong portfolio of gold-silver and copper assets and royalties in North America. Riverside has extensive experience and knowledge operating in Mexico and Canada and leverages its large database to generate a portfolio of prospective mineral properties. In addition to Riverside's own exploration spending, the Company also strives to diversify risk by securing joint-venture and spin-out partnerships to advance multiple assets simultaneously and create more chances for discovery. Riverside has properties available for option, with information available on the Company's website atwww.rivres.com.ON BEHALF OF RIVERSIDE RESOURCES INC.\"John-Mark Staude\"Dr. John-Mark Staude, President & CEOFor additional information contact:John-Mark StaudePresident, CEORiverside Resources Inc.This email address is being protected from spambots. You need JavaScript enabled to view it.Phone: (778) 327-6671Fax: (778) 327-6675Web:www.rivres.comEric NegraeffInvestor RelationsRiverside Resources Inc.Phone: (778) 327-6671TF: (877) RIV-RES1Web:www.rivres.comCertain statements in this press release may be considered forward-looking information. These statements can be identified by the use of forward-looking terminology (e.g., \"expect\",\" estimates\", \"intends\", \"anticipates\", \"believes\", \"plans\"). Such information involves known and unknown risks -- including the availability of funds, the results of financing and exploration activities, the interpretation of exploration results and other geological data, or unanticipated costs and expenses and other risks identified by Riverside in its public securities filings that may cause actual events to differ materially from current expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release.Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release."
    },
    {
        "title": "Luca Mining Achieves Targeted Throughput Rates at Campo Morado and Tahuehuto Mines",
        "date": "2025-02-05",
        "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/1592-tsx-venture/luca/174741-luca-achieves-targeted-throughput-rates-at-campo-morado-and-tahuehuto-mines.html",
        "content": "VANCOUVER, BC,Feb. 5, 2025/CNW/ -Luca Mining Corp.(\"Luca\" or the \"Company\") (TSXV: LUCA) (OTCQX: LUCMF) (Frankfurt: Z68) is pleased to announce that programs underway to maximize operational efficiencies at both theCampo Moradozinc/copper/gold mine and the Tahuehueto gold/silver mine have yielded excellent results.Campo MoradoThe Company has achieved its targeted throughput rates at theCampo Moradozinc/copper/gold mine of 2,000 tonnes per day (\"tpd\"). This was a milestone set when Luca's newly contracted mining team, Cominvi, S.A. de C.V. (\"Cominvi\"), was seconded in August of last year. Cominvi, working with the Luca team, achieved sustained 2,000 tpd in the latter part of Q4 2024 and theCampo Moradomill is now consistently running at this rate, representing a 43% increase over the preceding six months. In the month ofJanuary 2025, the Campo Morado mill processed over 62,850 tonnes of ore; and ample built-in capacity at the mill remains towards future production growth.  With 2,000 tpd achieved, the next phase of optimization efforts will now focus on improving throughput to 2,400 tpd over the coming months.TahuehuetoCommissioning of this new gold mine has been progressing extremely well and is nearing completion. Throughput at the Tahuehueto mill has started to stabilize at the 1,000 tpd level. In the month ofJanuary 2025, even with a planned shutdown of greater than one week (consisting of testing and commiserate adjustments), the mill processed over 24,700 tonnes of ore; an exciting milestone for Luca. In preparation for commercial production, the Company is working to ensure sufficient parts and commodity supply redundancy is in place for its operations through purchasing and stocking a new warehouse now under construction on site.Dan Barnholden, CEO, commented, \"I am very pleased to see that our careful planning is allowing us to meet these important throughput objectives. Steady and stable operations with back up contingencies are key to consistent results. I would like to congratulate our entire Luca team and affiliates on a job well done. We've been able to quickly increase production at both operations and we can clearly see a path forward for further increases ahead.\"About Luca Mining Corp.Luca Mining (TSX-V: LUCA, OTCQX: LUCMF, Frankfurt: Z68) is a diversified Canadian mining company with two 100%-owned producing mines within the prolificSierra Madremineralized belt inMexicowhich hosts numerous producing and historic mines along its trend. The Company produces gold, copper, zinc, silver and lead from these mines that each have considerable development and resource upside.TheCampo Moradopolymetallic VMS mine is an underground operation located inGuerrero State.  It produces copper-zinc-lead concentrates with precious metals credits. It is currently undergoing an optimization program which is already generating significant improvements in recoveries, grades, efficiencies, and cashflows.The Tahuehueto epithermal gold and silver mine is a new underground operation in Durango State.  The Company is commissioning the Tahuehueto mill and expects to achieve commercial production in early 2025.Qualified PersonThe technical information contained in this news release has been reviewed and approved by Mr.Paul D. Gray, P.Geo., Vice-President Exploration at Luca Mining.  Mr. Gray is a Qualified Person for the Company as defined by National Instrument 43-101.On Behalf of the Board of Directors(signed) \"Dan Barnholden\"Dan Barnholden, Chief Executive OfficerFor more information, please visit:www.lucamining.comCautionary Note Regarding Forward-Looking StatementsIt should be noted that Luca declared commercial production atCampo Moradoprior to completing a feasibility study of mineral reserves demonstrating economic and technical viability. Accordingly, readers should be cautioned that Luca's production decision has been made without a comprehensive feasibility study of established reserves such that there is greater risk and uncertainty as to future economic results from theCampo Moradomine and a higher technical risk of failure than would be the case if a feasibility study were completed and relied upon to make a production decision. Luca has completed a preliminary economic assessment (\"PEA\") mining study on theCampo Moradomine that provides a conceptual life of mine plan and a preliminary economic analysis based on the previously identified mineral resources (see news releases datedNovember 8, 2017, andApril 4, 2018).Statements contained in this news release that are not historical facts are \"forward-looking information\" or \"forward-looking statements\" (collectively, \"Forward-Looking Information\") within the meaning of applicable Canadian securities laws. Forward Looking Information includes, but is not limited to, disclosure regarding the Financings, the anticipated timing of closing thereof and the expected use of proceeds therefrom; and other possible events, conditions or financial performance that are based on assumptions about future economic conditions and courses of action; the timing and costs of future activities on the Company's properties, such as production rates and increases; success of exploration, development and bulk sample processing activities, and timing for processing at its own mineral processing facility on the Tahuehueto project site. In certain cases, Forward-Looking Information can be identified using words and phrases such as \"plans,\" \"expects,\" \"scheduled,\" \"estimates,\" \"forecasts,\" \"intends,\" \"anticipates\" or variations of such words and phrases. In preparing the Forward-Looking Information in this news release, the Company has applied several material assumptions, including, but not limited to, that all requisite approvals in respect of the Financings will be received, and all conditions precedent to completion of the Financings will be satisfied, in a timely manner; the Company will be able to raise additional capital as necessary; the current exploration, development, environmental and other objectives concerning the Campo Morado Mine and the Tahuehueto Project can be achieved; the program to improve mining operations atCampo Moradowill proceed as planned; the continuity of the price of gold and other metals, economic and political conditions, and operations. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance, or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the Forward-Looking Information. There can be no assurance that Forward-Looking Information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on Forward-Looking Information. Except as required by law, the Company does not assume any obligation to release publicly any revisions to Forward-Looking Information contained in this news release to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release."
    }
]